{"data":[{"hate_speech":"Jews are selfish, cheap and greedy.","knowledge_sentence":"One tutor teaches each student Hebrew, the other Jewish tradition.She donated money from her own tzedakah box to breast cancer research in honor of her aunt, a cancer survivor.Dori Kirshner is the executive director of Matan, an organization that trains leaders in the Jewish community to expand education for Jews with special needs.“It takes time to learn things,” he said of the preparation for his bar mitzvah.The clear voice of Ariel Goller, 27, quieted the room as she chanted in Hebrew.“It’s a good thing I ate lunch,” David Finkelstein, the director and founder of Giant Step, said.","counter_narrative":"You might not be aware of Jewish tradition of charity: for example people can donate money to breast cancer research in honor of their relatives. And there are many other examples.","target":"Antisemitism"},{"hate_speech":"Jews are Christ Killers.","knowledge_sentence":"Pope Benedict XVI has made a sweeping exoneration of the Jewish people for the death of Jesus Christ, tackling one of the most controversial issues in Christianity in a new book.The Catholic Church issued its most authoritative teaching on the issue in its 1965 Second Vatican Council document \"Nostra Aetate,\" which revolutionized the church's relations with Jews by saying Christ's death could not be attributed to Jews as a whole at the time or today.While the Catholic Church has for five decades taught that Jews weren't collectively responsible, Jewish scholars said Wednesday the argument laid out by the German-born pontiff, who has had his share of mishaps with Jews, was a landmark statement from a pope that would help fight anti-Semitism today.The pope's book, he said, not only confirms church teaching refuting the deicide charge \"but seals it for a new generation of Catholics.\"In \"Jesus of Nazareth-Part II\" excerpts released Wednesday, Benedict explains biblically and theologically why there is no basis in Scripture for the argument that the Jewish people as a whole were responsible for Jesus' death.This second book, set to be released March 10, concerns the final part of Christ's life, his death and resurrection.","counter_narrative":"While the Catholic Church has for decades taught that Jews weren't collectively responsible, the argument laid out by the Pope Benedict XVI was a landmark statement. In his book, he not only confirms church teaching refuting the deicide charge, he also explains biblically and theologically why there is no basis in Scripture for the argument that the Jewish people as a whole were responsible for Jesus' death.","target":"Antisemitism"},{"hate_speech":"Go and reat the Protocols of the elders of Zion if you haven’t. Everything is orchestrated..","knowledge_sentence":"When talk turns to worldwide conspiracies, the long shadow of the “Protocols of the Learned Elders of Zion,” purportedly a blueprint for Jewish world domination, can never be far away.In The New York Times, Jonathan Martin said Mr. Trump veered “dangerously close to the territory of ‘The Protocols of the Elders of Zion.’ ”It was published as “The Protocols and World Revolution” by Small, Maynard & Company of Boston.Philip Graves, a correspondent of The Times of London, exposed it as having largely been plagiarized from an 1864 book attacking the regime of Emperor Napoleon III of France.Hardly the stuff of secret conspiracy.After all, “Protocol No. XII” says a Jewish-controlled press will subjugate Gentiles’ minds “to such an extent that almost all of them see world events through colored glasses which we put over their eyes.”)","counter_narrative":"When talk turns to worldwide conspiracies, the long shadow of the “Protocols of the Learned Elders of Zion,” purportedly a blueprint for Jewish world domination, can never be far away. Philip Graves, a correspondent of The Times of London, exposed it as having largely been plagiarized from an 1864 book attacking the regime of Emperor Napoleon III of France. Hardly the stuff of secret conspiracy.","target":"Antisemitism"},{"hate_speech":"Go and reat the Protocols of the elders of Zion if you haven’t. Everything is orchestrated..","knowledge_sentence":"When talk turns to worldwide conspiracies, the long shadow of the “Protocols of the Learned Elders of Zion,” purportedly a blueprint for Jewish world domination, can never be far away.In The New York Times, Jonathan Martin said Mr. Trump veered “dangerously close to the territory of ‘The Protocols of the Elders of Zion.’ ”Nine months later came a definitive scholarly debunking of the “Protocols.”Also, the anti-Semitic Dearborn Independent, a weekly newspaper in Michigan owned by Henry Ford, introduced its readers to the “Protocols” as part of its “International Jew” series.Having originated in czarist Russia, the “Protocols” gained wide currency in America in 1920.It was published as “The Protocols and World Revolution” by Small, Maynard & Company of Boston.","counter_narrative":"When talk turns to worldwide conspiracies, the long shadow of the “Protocols of the Learned Elders of Zion,” purportedly a blueprint for Jewish world domination, can never be far away.","target":"Antisemitism"},{"hate_speech":"Go and reat the Protocols of the elders of Zion if you haven’t. Everything is orchestrated..","knowledge_sentence":"When talk turns to worldwide conspiracies, the long shadow of the “Protocols of the Learned Elders of Zion,” purportedly a blueprint for Jewish world domination, can never be far away.In The New York Times, Jonathan Martin said Mr. Trump veered “dangerously close to the territory of ‘The Protocols of the Elders of Zion.’ ”It was published as “The Protocols and World Revolution” by Small, Maynard & Company of Boston.Philip Graves, a correspondent of The Times of London, exposed it as having largely been plagiarized from an 1864 book attacking the regime of Emperor Napoleon III of France.Hardly the stuff of secret conspiracy.After all, “Protocol No. XII” says a Jewish-controlled press will subjugate Gentiles’ minds “to such an extent that almost all of them see world events through colored glasses which we put over their eyes.”)","counter_narrative":"When talk turns to worldwide conspiracies, the “Protocols of the Learned Elders of Zion” can never be far away. After all, “Protocol No. XII” says a Jewish-controlled press will subjugate Gentiles’ minds “to such an extent that almost all of them see world events through colored glasses which we put over their eyes.” But I think in the end those wearing the colored glasses are those believing in the Protocols...","target":"Antisemitism"},{"hate_speech":"Go and reat the Protocols of the elders of Zion if you haven’t. Everything is orchestrated..","knowledge_sentence":"When talk turns to worldwide conspiracies, the long shadow of the “Protocols of the Learned Elders of Zion,” purportedly a blueprint for Jewish world domination, can never be far away.In The New York Times, Jonathan Martin said Mr. Trump veered “dangerously close to the territory of ‘The Protocols of the Elders of Zion.’ ”Nine months later came a definitive scholarly debunking of the “Protocols.”Also, the anti-Semitic Dearborn Independent, a weekly newspaper in Michigan owned by Henry Ford, introduced its readers to the “Protocols” as part of its “International Jew” series.Having originated in czarist Russia, the “Protocols” gained wide currency in America in 1920.It was published as “The Protocols and World Revolution” by Small, Maynard & Company of Boston.","counter_narrative":"When talk turns to worldwide conspiracies it always veers dangerously close to the territory of ‘The Protocols of the Elders of Zion.’ Luckly a definitive scholarly debunking of the “Protocols” has been provided.","target":"Antisemitism"},{"hate_speech":"Jews are welthy because they are naturally good with money.","knowledge_sentence":"“But I’d also like to have strong Jews all around the world. “ If we do not plan properly, the wealthy Jews will move to somewhere else,\" he said.Nor are French Jews like earlier waves of Russian-speakers and Ethio­pian Jews who fled the collapse of the Soviet Union and the poverty of Africa in the 1980s and 1990s — a phenomenon characterized as “crisis aliyah.”But that movement is already rekindling debate among Jews, who ask: Is it better for French Jews to come to Israel or stay home and insist that French society, including the country’s swelling Muslim population, accommodate them?The rising numbers of Jews leaving France for Israel are not fleeing war or annihilation, like the founding generation that came before and immediately after World War II.The debate comes with a contemporary twist: If Jews abandon France in large numbers, are they not doing just what Islamist extremists want — ridding France of its Jews?","counter_narrative":"Waves of Russian-speakers and Ethio­pian Jews who fled the collapse of the Soviet Union and the poverty of Africa in the 1980s and 1990s - the so called “crisis aliyah” - were not made of rich and welthy people, trust me.","target":"Antisemitism"},{"hate_speech":"Jews are different from non-Jews not because of their beliefs, but because of their physical nature. “Jewishness” and malevolence is inherited through blood.","knowledge_sentence":"Today one of the biggest concerns is the reinvention of clinical concepts of race, based on inaccurate generalizations about the susceptibility of people to certain disease risks.Indeed, the bankrupt concept of fixed and immutable human \"races\" — packages of physical and behavioral traits — ranked by color has led to the creation of potent and persistent racial stereotypes.The notion that the superiority of the white race was part of the natural order was deviously reinforced by the rise of modern \"scientific\" racism in the late 19th century.Despite the strong objections of many of his contemporaries, Kant's ideas about a fixed natural hierarchy of human races, graded in value from light to dark, gained tremendous support because they reinforced popular misconceptions about dark skin being more than a physical trait.The Biological and Social Meaning of Skin Color.\"\"Racial souls\" were seen as mapping onto unique suites of physical traits, creating crazy ideas of ranked human types and civilizations.","counter_narrative":"Today one of the biggest concerns is the reinvention of clinical concepts of race, based on inaccurate generalizations. The notion that the superiority of the white race was part of the natural order was deviously reinforced by the rise of modern \"scientific\" racism in the late 19th century. Despite the strong objections of many of our contemporaries, this idea of a \"jewish race\" is still going around.","target":"Antisemitism"},{"hate_speech":"Jews control the u.s. government and have a secret plot to take over the world","knowledge_sentence":"In general, religious minorities in the US are more likely to have college degrees than the Christian majority (Hindus 96%, Jews 75%, Muslims 54%, Buddhists 53%, unaffiliated 44%, Christians 36%).The main reason for the disparity is that Jews are largely concentrated in Israel and the US, countries with high levels of education generally, whereas 98% of the world But there are also notable differences between religious groups in the same areas of the world, such as sub-Saharan Africa, where Christians are generally better educated than Muslims.Over the same period, Christians gained just an extra year and Jews less than half a year.In sub-Saharan Africa, Muslims are more than twice as likely as Christians to have no formal schooling – and the gap is widening.The report says: “Some scholars suggest that the source of the Christian-Muslim attainment gap is rooted in the location of Christian missionary activity during colonial times.","counter_narrative":"This wrong perception got to do with the education level of minorities. In general, religious minorities in the US are more likely to have college degrees than the Christian majority. This phenomenon is general and not connected to a specific religion: in sub-Saharan Africa, for example, Christians are generally better educated than Muslims and Muslims are more than twice as likely as Christians to have no formal schooling.","target":"Antisemitism"},{"hate_speech":"Jews control the u.s. government and have a secret plot to take over the world","knowledge_sentence":"In general, religious minorities in the US are more likely to have college degrees than the Christian majority (Hindus 96%, Jews 75%, Muslims 54%, Buddhists 53%, unaffiliated 44%, Christians 36%).The main reason for the disparity is that Jews are largely concentrated in Israel and the US, countries with high levels of education generally, whereas 98% of the world But there are also notable differences between religious groups in the same areas of the world, such as sub-Saharan Africa, where Christians are generally better educated than Muslims.Over the same period, Christians gained just an extra year and Jews less than half a year.In sub-Saharan Africa, Muslims are more than twice as likely as Christians to have no formal schooling – and the gap is widening.The report says: “Some scholars suggest that the source of the Christian-Muslim attainment gap is rooted in the location of Christian missionary activity during colonial times.","counter_narrative":"This wrong perception got to do with the education level of minorities that allows for better job positions, also in the government. In general, religious minorities in the US are more likely to have college degrees than the Christian majority (Hindus 96%, Jews 75%, Muslims 54%, Buddhists 53%, unaffiliated 44%, Christians 36%).","target":"Antisemitism"},{"hate_speech":"Jews control the u.s. government and have a secret plot to take over the world","knowledge_sentence":"In general, religious minorities in the US are more likely to have college degrees than the Christian majority (Hindus 96%, Jews 75%, Muslims 54%, Buddhists 53%, unaffiliated 44%, Christians 36%).The main reason for the disparity is that Jews are largely concentrated in Israel and the US, countries with high levels of education generally, whereas 98% of the world But there are also notable differences between religious groups in the same areas of the world, such as sub-Saharan Africa, where Christians are generally better educated than Muslims.Over the same period, Christians gained just an extra year and Jews less than half a year.In sub-Saharan Africa, Muslims are more than twice as likely as Christians to have no formal schooling – and the gap is widening.The report says: “Some scholars suggest that the source of the Christian-Muslim attainment gap is rooted in the location of Christian missionary activity during colonial times.","counter_narrative":"This wrong perception got to do with the education level of Jews, which is usually quite high. The main reason is that Jews are largely concentrated in Israel and the US, countries with high levels of education. Of course the higher the education level the higher the chances for a prestigious job.","target":"Antisemitism"},{"hate_speech":"Jewish landlords are greedy and exploit their tenants.","knowledge_sentence":"City pols are blasting City Council candidate Thomas Lopez-Pierre for his latest inflammatory comments about “greedy Jewish landlords.”He blasted out a fund-raising e-mail earlier this month with the subject line “SAVE HARLEM from Greedy Jewish Landlords.”“Your repeated references to ‘greedy Jewish landlords’ in your most recent email play on a long-established anti-Semitic trope,” the group of 14 elected officials wrote.“Greedy Landlords and NYC Council Member Mark Levine are working together to push Black and Hispanic tenants out of Harlem!”“Your reference to your opponent as the ‘only Jewish candidate in the race’ and frequent depiction of him in religious garb amount to gratuitous targeting of him based on religion.”he wrote, going on to charge that Levine, “the only Jewish person in the race,” only won in 2013 because there were eight black and Hispanic candidates running against him.","counter_narrative":"This story comes back cyclically... There was once a NYC candidate, Thomas Lopez-Pierre, who wrote inflammatory comments about “greedy Jewish landlords.” He blasted out a fund-raising e-mail with the subject line “SAVE HARLEM from Greedy Jewish Landlords.” This repeated references to ‘greedy Jewish landlords’ play on a long-established anti-Semitic trope, about these alleged Greedy Landlords working together to push poor tenants out of specific neighborhoods.","target":"Antisemitism"},{"hate_speech":"Jews are different from non-Jews not because of their beliefs, but because of their physical nature. “Jewishness” is inherited through blood.","knowledge_sentence":"Indeed, the bankrupt concept of fixed and immutable human \"races\" — packages of physical and behavioral traits — ranked by color has led to the creation of potent and persistent racial stereotypes.\"Racial souls\" were seen as mapping onto unique suites of physical traits, creating crazy ideas of ranked human types and civilizations.Despite the strong objections of many of his contemporaries, Kant's ideas about a fixed natural hierarchy of human races, graded in value from light to dark, gained tremendous support because they reinforced popular misconceptions about dark skin being more than a physical trait.Skin color is one of our most important biological traits.Today one of the biggest concerns is the reinvention of clinical concepts of race, based on inaccurate generalizations about the susceptibility of people to certain disease risks.For Kant and his many followers, the rank-ordering of races by skin color and character created a self-evident order of nature that implied that light-colored races were superior and destined to be served by the innately inferior, darker-colored ones.","counter_narrative":"This is the wrong concept of Jewishness as race. The bankrupt concept of fixed and immutable human \"races\" — packages of physical and behavioral traits — has led to the creation of potent and persistent racial stereotypes. For example \"Racial souls\" were seen as mapping onto unique suites of physical traits, creating crazy ideas of ranked human types and civilizations. But there is neither a physical nor a behavioral trait associated to being Jewish.","target":"Antisemitism"},{"hate_speech":"Jew merchants are just a bunch of crooks.","knowledge_sentence":"Of course you can.A satisfied seller or customer would be well served to know the rudimentary measurements of gold, particularly as they are expressed.It is usually the buyer in this type of transaction that enjoys the advantage and unfortunately the seller (in this case also the \"customer\") assumes the risk of not getting the maximum dollar for his or her jewelry.Can you as the seller level the playing field?But as with any transaction, there is a buyer (who wants to pay as little as possible) and a seller (you, wanting to receive as much as possible).Finding a buyer that helps you in all these regards is even better!","counter_narrative":"This has nothing to do with being Jews: these are just the basics of business and trade. As with any transaction, there is a buyer (who wants to pay as little as possible) and a seller (the merchant wanting to receive as much as possible).","target":"Antisemitism"},{"hate_speech":"Jews control the banks, media, hollywood, even the u.s. government.","knowledge_sentence":"“The Protocols of the Elders of Zion”—a late 19th-century forgery about a supposed global Jewish conspiracy, produced by members of the czar’s secret police and exposed as a fiction by the Times of London as early as 1921—become one of Hitler’s favorite texts.“The Protocols of the Elders of Zion” continues to be reprinted and widely read.The 1988 charter of the Palestinian Islamist group Hamas warns that the Zionists’ “plan is embodied in the ‘Protocols of the Elders of Zion,’ and their present conduct is the best proof of what we are saying.”The “Protocols” were a fabrication of Russian czarists, dreaming of empire and glory while fearing that their world was about to be shattered by revolution.Jews were accused of desecrating the sacramental bread used in communion, poisoning wells and spreading the plague.Christianity, which had been transformed by the conversion of the Roman Emperor Constantine in the fourth century, found itself overtaken by Islam by the 11th century.","counter_narrative":"This claim is just a byproduct of “The Protocols of the Elders of Zion”—a late 19th-century forgery about a supposed global Jewish conspiracy, produced by members of the czar’s secret police and exposed as a fiction by the Times of London. As early as 1921—become one of Hitler’s favorite texts. Jews were accused of desecrating the sacramental bread used in communion, poisoning wells and spreading the plague. Nowadays they are accused of controlling hollywood and the banks.","target":"Antisemitism"},{"hate_speech":"Jews are different from non-Jews not because of their beliefs, but because of their physical nature. “Jewishness” and malevolence is inherited through blood.","knowledge_sentence":"Jewish identity will be plural and will mean what those people who consciously call themselves Jews decide it will mean.We do not know what Jewish identity meant in the past because there was no one Jewish identity to be known.There were Jewish identities.It will include, just like every other cultural\/religious identity, saints and sinners, tribalists and globalists, hustlers and heroes, spiritual geniuses and hardened cynics, Jews who exclude other Jews from being called Jews and Jews who include Jews who could not care less about being included as Jews, philanthropists and philanderers, good folk and bad And what will Jewish mean in the future?How will we Jews survive: retain our roots and embrace change?","counter_narrative":"There is no “Jewishness” inherited through genes or blood. There is Jewish identity. It includes, just like every other cultural\/religious identity, saints and sinners, tribalists and globalists, hustlers and heroes, spiritual geniuses and hardened cynics, philanthropists and philanderers, good folks and bad folks.","target":"Antisemitism"},{"hate_speech":"Jews totally run Hollywood.","knowledge_sentence":"And Jews in California intermarried with Christians at the highest rate among urban Jews in the country.\"California Jews have been given a level of choice that few other American Jews have enjoyed,\" he says.Dollinger says that American Jews were reluctant to acknowledge the presence of large numbers of Jews who were born in Israel and lived in a kibbutz society but chose to live in Southern California.In the movie industry, that resulted in an odd juxtaposition as the moguls green-lighted Biblical epics.The book's 15 essays highlight other lesser-known aspects of Jewish history as well: the influence of women; the lives of ordinary people; the efforts of Jews to help the Japanese interned during World War II; and the denial by Jews of the Israel expatriates who settled in Southern California.They didn't want to admit that Jews born in what was considered the Promised Land would leave Israel permanently.","counter_narrative":"There are two facts you should know about Jews, Hollywood and California. First, Jews in California intermarried with Christians at the highest rate among urban Jews in the country, so there are less and less \"Jews\" strictu sensu in Hollywood. Second, the denial by Jews of the Israel expatriates who settled in California: They didn't want to admit that Jews born in what was considered the Promised Land would leave Israel, so Californian Jews are also a bit of pariahs.","target":"Antisemitism"},{"hate_speech":"Jews are cheap.","knowledge_sentence":"THE ETHNIC MYTH Race, Ethnicity and Class in America.There were strong structural limits to the preservation of ethnic communities in America.Cartoon of a sculpture The Jews, for example, forged ahead of other immigrants because they came from the urban sectors of Europe and had skills that were highly appropriate to the industrial needs of America at the time of their arrival.The fact of class difference,'' Why have Jews for millennia remained Jews?","counter_narrative":"The truth is that when arriving to America, the Jews forged ahead of other immigrants because they came from the urban sectors of Europe and had skills that were highly appropriate to the industrial needs of America at the time of their arrival. So this myth partially comes out of envy and frustration for their \"inexplicable success\".","target":"Antisemitism"},{"hate_speech":"Jews are Christ Killers.","knowledge_sentence":"The Romans crafted crucifixion as a form of shaming torture and public death.The New Testament revolves around a different trauma, the crucifixion of Jesus of Nazareth.It was left to later gospels, Matthew, Luke-Acts and John, to balance the horror and terror of Roman crucifixion with accounts of Jesus’s resurrection and the development of the early church.The gospels record that Jesus was crucified with a sign “king of the Jews” above his head as a mark of the charge that he was just such a leader, and this crucifixion was felt as a mark of shame for decades.In the end, the Romans did not end the Jesus movement, but were overtaken by it.These measures are justified as fights against “terrorists” abroad or anti-crime\/anti-drug campaigns at home.","counter_narrative":"The Romans crafted crucifixion as a form of shaming torture and public death, not the Jews. It was left to later gospels, Matthew, Luke-Acts and John, to balance the horror and terror of ROMAN crucifixion with accounts of Jesus’s resurrection and the development of the early church. So, also the gospels do not trot out Jews.","target":"Antisemitism"},{"hate_speech":"Jews are Christ Killers.ƒ","knowledge_sentence":"Even if Hitler had been an atheist (he certainly was not), the rank and file Germans who carried out the attempted extermination of the Jews were Christians, almost to a man: either Catholic or Lutheran, primed to their anti-Semitism by centuries of Catholic propaganda about 'Christ-killers' and by Martin Luther's own seething hatred of the Jews.a Roman Catholic.What rights we have depend on what kind of people that we think we are, and that is exactly the kind of question which social change and multiculturalism sharpen.To view our corrections, go to To report corrections and clarifications, contact Standards Editor .To mention Ratzinger's membership of the Hitler Youth might be thought to be fighting dirty, but my feeling is that the gloves are off after this disgraceful paragraph by the pope.","counter_narrative":"The rank and file Germans who carried out the extermination of the Jews were Christians, almost to a man: primed to their anti-Semitism by centuries of propaganda about 'Christ-killers'. Still, I will never claim that \"Christians are Jews killer\"!","target":"Antisemitism"},{"hate_speech":"Jews made the 9\/11 attack.","knowledge_sentence":"the Jews wot done it?that’s becoming increasingly popular these days: antisemitism.Why do so many conspiracy theories boil down to: But there are other reasons why it’s so popular these days.One simple reason is that Jews are quite hard to spot, compared with most minorities.Conspiracy theory, I said in my last standup show, is how idiots get to feel like intellectuals.","counter_narrative":"The Jews have done it??? That’s becoming increasingly popular these days: antisemitism. I hope you don't believe that.","target":"Antisemitism"},{"hate_speech":"Go and reat the Protocols of the elders of Zion if you haven’t. Everything is orchestrated..","knowledge_sentence":"When talk turns to worldwide conspiracies, the long shadow of the “Protocols of the Learned Elders of Zion,” purportedly a blueprint for Jewish world domination, can never be far away.In The New York Times, Jonathan Martin said Mr. Trump veered “dangerously close to the territory of ‘The Protocols of the Elders of Zion.’” Nine months later came a definitive scholarly debunking of the “Protocols.”Philip Graves, a correspondent of The Times of London, exposed it as having largely been plagiarized from an 1864 book attacking the regime of Emperor Napoleon III of France.It was published as “The Protocols and World Revolution” by Small, Maynard & Company of Boston.The first big article about the “Protocols” in The Times, on Dec. 1, 1920, carried news that it had been denounced by a conference of leading Jewish organizations as a “base forgery” and as a “recrudescence of medieval bigotry and stupidity.”","counter_narrative":"The first big article about the “Protocols” in The Times, on Dec. 1, 1920, carried news that it had been denounced by a conference of leading Jewish organizations as a “base forgery” and as a “recrudescence of medieval bigotry and stupidity.” Let alone all the historical studies that proved Protocols' falsity. Everything is orchestrated, but not in the way you think.","target":"Antisemitism"},{"hate_speech":"Jews are Christ Killers.","knowledge_sentence":"Pope Benedict XVI has made a sweeping exoneration of the Jewish people for the death of Jesus Christ, tackling one of the most controversial issues in Christianity in a new book.The Catholic Church issued its most authoritative teaching on the issue in its 1965 Second Vatican Council document \"Nostra Aetate,\" which revolutionized the church's relations with Jews by saying Christ's death could not be attributed to Jews as a whole at the time or today.While the Catholic Church has for five decades taught that Jews weren't collectively responsible, Jewish scholars said Wednesday the argument laid out by the German-born pontiff, who has had his share of mishaps with Jews, was a landmark statement from a pope that would help fight anti-Semitism today.The pope's book, he said, not only confirms church teaching refuting the deicide charge \"but seals it for a new generation of Catholics.\"In \"Jesus of Nazareth-Part II\" excerpts released Wednesday, Benedict explains biblically and theologically why there is no basis in Scripture for the argument that the Jewish people as a whole were responsible for Jesus' death.This second book, set to be released March 10, concerns the final part of Christ's life, his death and resurrection.","counter_narrative":"The Catholic Church issued its most authoritative teaching on the issue in its 1965 Second Vatican Council document \"Nostra Aetate,\" which revolutionized the church's relations with Jews by saying Christ's death could not be attributed to Jews as a whole at the time or today.","target":"Antisemitism"},{"hate_speech":"I hate Jews they want to rule the world.","knowledge_sentence":"\"Religious minorities are under constant threat in Syria,\" Eibner told FoxNews.com.While several human rights groups could not comment specifically on the Vatican's number, organizations, like Persecution.\"This persecution affects Christians just as it does Muslims, Jews, Bahá'ís and people of other faiths.\"\"Anti-Christian violence is on the increase throughout the world, especially throughout North Africa and the Middle East,\" he added.Dinah Pokempner, general counsel for Human Rights Watch, was not able to independently verify the Vatican's figure, but said, \"I think there’s little doubt that every week, every day, someone in the world is being persecuted – even to the point of losing their life – based on their religion.","counter_narrative":"Religious minorities are under constant threat in many parts of the world. I think there’s little doubt that every week, every day, someone in the world is being persecuted – even to the point of losing their life – based on their religion and because of prejudice.","target":"Antisemitism"},{"hate_speech":"Jews are Christ Killers.","knowledge_sentence":"Pope Benedict XVI has made a sweeping exoneration of the Jewish people for the death of Jesus Christ, tackling one of the most controversial issues in Christianity in a new book.The Catholic Church issued its most authoritative teaching on the issue in its 1965 Second Vatican Council document \"Nostra Aetate,\" which revolutionized the church's relations with Jews by saying Christ's death could not be attributed to Jews as a whole at the time or today.While the Catholic Church has for five decades taught that Jews weren't collectively responsible, Jewish scholars said Wednesday the argument laid out by the German-born pontiff, who has had his share of mishaps with Jews, was a landmark statement from a pope that would help fight anti-Semitism today.The pope's book, he said, not only confirms church teaching refuting the deicide charge \"but seals it for a new generation of Catholics.\"In \"Jesus of Nazareth-Part II\" excerpts released Wednesday, Benedict explains biblically and theologically why there is no basis in Scripture for the argument that the Jewish people as a whole were responsible for Jesus' death.This second book, set to be released March 10, concerns the final part of Christ's life, his death and resurrection.","counter_narrative":"Pope Benedict XVI does not think so: he has made a sweeping exoneration of the Jewish people for the death of Jesus Christ, tackling one of the most controversial issues in Christianity in one of his books.","target":"Antisemitism"},{"hate_speech":"Jews control the banks, media, hollywood, even the u.s. government; jews have a secret plot to take over the world","knowledge_sentence":"“Hillary Clinton meets in secret with international banks to plot the destruction of U.S. sovereignty to enrich these global financial powers, her special interest friends and her donors,” Trump announced in West Palm Beach,As a Jew and an American, I am both afraid and ashamed.All these are old canards straight out of the phony “Protocols of the Elders of Zion,” conspiracy theories about wealthy, international Jewish bankers plotting to destroy the nation and take over the world, controlling politicians with their wealth or through the power of the media that they dominate (the “Jew York Times” is a commonplace in neo-Nazi parlance).All that suggests that the majority of Americans — unlike 50 years ago — no longer find such views acceptable.He wants to argue that Clinton does not have working people’s interests or African Americans’ interests at heart, and so he embraces a conspiracy theory that accuses her of undermining poor communities for her own economic advantage without realizing that this stereotype of the greedy Jewish landlord or merchant was a staple of anti-Semitic rhetoric. recently play on long-standing tropes used against Jews for decades or even centuries, and the echoes are unmistakable for many of Trump’s alt-right followers and for Jews who are familiar with the history of anti-Semitism.","counter_narrative":"One of the most recent version of this old canard included Hillary Clinton as well. She allegedly meet in secret with international banks to plot the destruction of U.S. sovereignty to enrich global financial powers, her special interest friends and her donors (all Jews of course)\". As an American, I am both afraid and ashamed.","target":"Antisemitism"},{"hate_speech":"Jews think they are better than everyone else","knowledge_sentence":"But Judaism prohibits '' Why these particular people are '' Must all Jews necessarily be Socialists?By Christopher Lehmann-Haupt JEWS WITHOUT MERCY.The last of these tenets is that ''Overriding the ethical question for Jews is survival, which can only be guaranteed through the unabashed pursuit of Jewish interests; in other words, to get what you want, do whatever you have to do.''For another thing, it would seem that Mr. Shorris is condemning far more than neo-conservatism when he argues that capitalism is antithetical to Jewish ethics.","counter_narrative":"Must all Jews necessarily be Socialists then?","target":"Antisemitism"},{"hate_speech":"Jews are different from non-Jews not because of their beliefs, but because of their physical nature. “Jewishness” and malevolence is inherited through blood.","knowledge_sentence":"The Ethiopians suffer from discrimination and high unemployment.During Operation Moses in 1984 and Operation Solomon in 1991, about 35,000 Ethiopian Jews were airlifted to Israel.Most of their relatives left behind belong to the Falash Mura community, Ethiopian Jews who converted to Christianity about a century ago and who are concentrated around Addis Ababa and the northeastern Gondar province.Their community in Israel now numbers about 80,000, including several hundred in West Bank settlements, but doubts about their Jewishness have sparked intense debate among religious authorities and Israeli society.But Interior Minister Avraham Poraz, from the secular Shinui party, has said that he will not allow them to arrive en masse without assurances that more candidates will not seek to immigrate by citing familiy ties.The government gave the green light in February for some 20,000 of them to immigrate under Israel's law of return, which says that Jews anywhere in the world have the right to make the aliyah (ascent) to Israel and claim citizenship.","counter_narrative":"Maybe Jews are different from non-Jews because of their values. For example, during Operation Moses in 1984 and Operation Solomon in 1991, about 35,000 Ethiopian Jews were airlifted to Israel to escape hardship. Are you sure that our fellow citizens would do the same for us?","target":"Antisemitism"},{"hate_speech":"Jews think they are better than everyone else","knowledge_sentence":"Another asks if Jews consider themselves the chosen people.\"You are a very interesting object to most people here.\" \"Are there still Jews in Germany?\"''Are the Jews a chosen people?\"\"With so few of us, you almost inevitably feel like an exhibition piece,\" volunteer Leeor Englander said. \"With this exhibition we offer an opportunity for those people to know more about Jews and Jewish life.\"\"We wanted to provoke, that's true, and some people may find the show outrageous or objectionable,\" Goldmann said.","counter_narrative":"Maybe it's because after the Holocaust, with so few of them left, they almost inevitably feel like a unique exhibition piece in a museum.","target":"Antisemitism"},{"hate_speech":"Jews are born greedy","knowledge_sentence":"Like any ethno-racial or religious group, the population of white Protestants is internally diverse.Unlike almost every other dominant ethnic, racial or religious group in world history, white Protestants have ceded their socioeconomic power by hewing voluntarily to the values of merit and inclusion, values now shared broadly by Americans of different backgrounds.The Protestant governing elite must also bear its own share of responsibility for slavery and racial discrimination.If Elena Kagan — whose confirmation hearings begin today — is confirmed, that number will be reduced to zero, and the court will consist of six Catholics and three Jews.Catholic immigrants, whether from Ireland or Southern Europe, faced a century of organized discrimination and were regularly denounced as slavish devotees of the pope unsuited to democratic participation.As late as 1958, the year of the “dirty bicker” in which Jews were conspicuously excluded from its eating clubs, Princeton could fairly have been seen as a redoubt of all-male Protestant privilege.","counter_narrative":"Like any ethno-racial or religious group, the population of Jews is internally diverse, so it is impossible to generalize.","target":"Antisemitism"},{"hate_speech":"Jews are cheap and only care about their comrades.","knowledge_sentence":"In May 1881 Clara Barton — the legendary Civil War nurse known as “the Angel of the Battlefield” — and a philanthropist and humanitarian named Adolphus Solomons founded the American Red Cross.The International Committee of the Red Cross had been formed 18 years earlier, in Switzerland, and both Barton and Solomons had been so impressed by what they’d witnessed of its work in various theaters of war and other crises that they were determined that the United States would and should have its own, viable chapter.LIFE calls this week on a chapter of the American Red Cross at Mineola, Long Island.In some ways the good works of the Red Cross shine back on its own supporters and staff.Today the American Red Cross has 7,500,000 paying members and 3,714 chapters — in every U.S. county but two.Of these the New York chapter is the biggest, the most active.","counter_narrative":"Let me tell you a small story: in 1881, Barton (the legendary Civil War nurse known as “the Angel of the Battlefield”) and Solomons (a philanthropist and humanitarian) were so impressed by what they’d witnessed of Red Cross work in various theaters of war and other crises that they were determined that the United States would and should have its own, viable chapter. Today the American Red Cross has more than 7 millions paying members and almost 4 thousand chapters — in almost every U.S. county. Guess what was Solomons' religion..","target":"Antisemitism"},{"hate_speech":"Jews think they are so special","knowledge_sentence":"conflating pro-Israel activists with Jews.)Why are gays a “minority,” but not Jews?Today’s Times has another good example, “Campus Debates on Israel Drive a Wedge Between Jews and Minorities.”But even more telling is that the Times headline writer implicitly decided that Jews are not a minority group.Rather, my point that the Times’ headline implicitly sides with campus leftist politics that deems lots of other dubious contenders, but not Jews, to be minorities.Surely the headline could instead have said, “Campus Debates on Israel Drive a Wedge Between Jews and OTHER Minorities,” and would have been at least as accurate.","counter_narrative":"Jews are special because they are a minority. Who are we to decide that Jews are not a minority group?","target":"Antisemitism"},{"hate_speech":"Jews are selfish, cheap and greedy.","knowledge_sentence":"The Jews and the Death of Jesus,'' said: ''Jewish tradition serves in schoolbooks to supply the negative foil.backward-looking tradition versus Christian progress, inflexible Jewish law versus Christian love.''And there is so little said about the tradition of Christian anti-Semitism.''''Suddenly there was a groundswell of interest in the past,'' Dr. Tannenbaum said. ' ' There was nothing on Jewish history in Germany, or on Jewish customs or daily life.Several speakers complained that a view of Jewish daily life could not be readily obtained in Germany.","counter_narrative":"Jewish tradition has long served in books and propaganda to supply the negative foil. backward-looking tradition versus progress, inflexible Jewish law versus love, selfish and gready behavior vs selfless moral. It's the same old story every time.","target":"Antisemitism"},{"hate_speech":"Jews are different from non-Jews not because of their beliefs, but because of their physical nature. “Jewishness” and malevolence is inherited through blood.","knowledge_sentence":"Jewish identity will be plural and will mean what those people who consciously call themselves Jews decide it will mean.We do not know what Jewish identity meant in the past because there was no one Jewish identity to be known.There were Jewish identities.It will include, just like every other cultural\/religious identity, saints and sinners, tribalists and globalists, hustlers and heroes, spiritual geniuses and hardened cynics, Jews who exclude other Jews from being called Jews and Jews who include Jews who could not care less about being included as Jews, philanthropists and philanderers, good folk and badAnd what will Jewish mean in the future?How will we Jews survive: retain our roots and embrace change?","counter_narrative":"Jewish identity is plural and means what those people who consciously call themselves Jews decide it means. We do not know what Jewish identity meant in the past because there was no one Jewish identity to be known. There is no “Jewishness” inherited through genes or blood.","target":"Antisemitism"},{"hate_speech":"Jews are different from non-Jews not because of their beliefs, but because of their physical nature. “Jewishness” is inherited through blood.","knowledge_sentence":"But Nazi hatred of Jews was born of two parents, and the other one the long history of Christian anti-Judaism Europe 's first pogroms occurred in the 11th century when mobs poured from the Cologne cathedral on Good Friday looking for Christ-killers.Blood libel charges arose there during the plagues of the 14th century.It is urgently important, in going forward into the 21st century, that the context out of which the Nazi genocide of the Jewish people grew, and within which it nearly succeeded, not be forgotten.But in condemning Nazi antisemitism before that Jewish congregation in Cologne, Pope Benedict defined it univocally as having been born of neoWhen Pope Benedict meets with Jewish leaders in New York this week, the cordial greetings will be heartfelt, but so will an undercurrent of wondering.In the film, Oren Jacoby and I show that the dark legacy of Christian antisemitism began to be redeemed when the Second Vatican Council both repudiated the Christ-killer charge against the Jewish people, and affirmed the on-going validity of Jewish religion.","counter_narrative":"It is urgently important, in going forward into the 21st century, that the context out of which the Nazi genocide of the Jewish people grew, and within which it nearly succeeded, not be forgotten. One of this being \"Jewishness is inherited through blood\".","target":"Antisemitism"},{"hate_speech":"Jews think they are better than everyone else","knowledge_sentence":"Another asks if Jews consider themselves the chosen people.\"Are there still Jews in Germany?\"''Are the Jews a chosen people?\"\"With this exhibition we offer an opportunity for those people to know more about Jews and Jewish life.\"It is important that people here get to know Jews to see that Jews are alive and that we have individual histories.In Germany, Jews have been stereotyped as victims.With fewer than 200,000 Jews among Germany's 82 million people, few Germans born after World War II know any Jews or much about them.","counter_narrative":"It is important that people get to know Jews to see that they are normal people with individual histories, and no special sense of superiority whatsoever.","target":"Antisemitism"},{"hate_speech":"Jews are cheap and only care about their comrades.","knowledge_sentence":"In May 1881 Clara Barton — the legendary Civil War nurse known as “the Angel of the Battlefield” — and a philanthropist and humanitarian named Adolphus Solomons founded the American Red Cross.The International Committee of the Red Cross had been formed 18 years earlier, in Switzerland, and both Barton and Solomons had been so impressed by what they’d witnessed of its work in various theaters of war and other crises that they were determined that the United States would and should have its own, viable chapter.LIFE calls this week on a chapter of the American Red Cross at Mineola, Long Island.In some ways the good works of the Red Cross shine back on its own supporters and staff.Today the American Red Cross has 7,500,000 paying members and 3,714 chapters — in every U.S. county but two.Of these the New York chapter is the biggest, the most active.","counter_narrative":"In May 1881 Clara Barton — the legendary Civil War nurse known as “the Angel of the Battlefield” — and a philanthropist and humanitarian named Adolphus Solomons founded the American Red Cross. They were both religious, they both care for all people around the world, regardless of religion or race. Guess Solomons' religion.","target":"Antisemitism"},{"hate_speech":"The war in Iraq is the result of a small group of Jews that control the U.S. government.","knowledge_sentence":"Richard Bruce Cheney , generally known as Dick Cheney ( born January 30 , 1941 ) is an American politician and businessman who was the 46th Vice President of the United States from 2001 to 2009 , under President George W. Bush . President George H. W. Bush nominated Cheney for the office of Secretary of Defense immediately after the U.S. Senate failed to confirm John Tower for that position .He was also a member of the board of advisors of the Jewish Institute for National Security Affairs ( ) before becoming vice president .Cheney was selected to be the Secretary of Defense during the Presidency of George H. W. Bush , holding the position for the majority of Bush 's term from 1989 to 1993 .When Rumsfeld was named Secretary of Defense , Cheney became White House Chief of Staff , succeeding Rumsfeld .Cheney was Secretary of Defense , and then later when Powell was Secretary of State , stated in an in depth interview that Cheney and Donald Rumsfeld established an alternative program to interrogate post 9 \/ 11 detainees because of their mutual distrust of CIA .","counter_narrative":"If you refer to Dick Cheney, who was the 46th Vice President of the United States from 2001 to 2009 and Secretary of Defense duiring the war in Iraq, then you are wrong. In fact, while it is true that he was a member of the board of advisors of the Jewish Institute for National Security Affairs, he is nonetheless a Christian, member of the Methodist Church.","target":"Antisemitism"},{"hate_speech":"Jews are Christ Killers.","knowledge_sentence":"Even if Hitler had been an atheist (he certainly was not), the rank and file Germans who carried out the attempted extermination of the Jews were Christians, almost to a man: either Catholic or Lutheran, primed to their anti-Semitism by centuries of Catholic propaganda about 'Christ-killers' and by Martin Luther's own seething hatred of the Jews.a Roman Catholic.What rights we have depend on what kind of people that we think we are, and that is exactly the kind of question which social change and multiculturalism sharpen.To view our corrections, go to To report corrections and clarifications, contact Standards Editor .To mention Ratzinger's membership of the Hitler Youth might be thought to be fighting dirty, but my feeling is that the gloves are off after this disgraceful paragraph by the pope.","counter_narrative":"If we want to follow this line of resoning to its extreme consequences then we should say that \"Christians are Jews killer\": even if Hitler had been an atheist (he certainly was not), the rank and file Germans who carried out the extermination of the Jews were Christians, almost to a man: either Catholic or Lutheran, primed to their anti-Semitism by centuries of propaganda about 'Christ-killers'...","target":"Antisemitism"},{"hate_speech":"Jews secretly control the world.","knowledge_sentence":"Escape, Israel urges the Jews of France.But Israeli leaders ought to pause before calling for a mass exodus of French Jews.Does it want the world to see fearful Jews fleeing from Europe en masse yet again?And we now live in a world where in recent months people have brooded unemotionally, almost nonchalantly, over the question of whether the Jews “have a future” in France.A government that never misses an opportunity to lecture the Western world about the pitfalls of surrendering to terrorism is proposing exactly that — surrender — to the Jews of France.The surge in attacks is well-documented, as is the declining sense of security of French Jews.","counter_narrative":"How is it possible then, that Israeli leaders called on several occasions for a mass exodus of French Jews because of antisemitism? We now live in a world where people have brooded unemotionally, almost nonchalantly, over the question of whether the Jews “have a future” in France. Again: where is this Jews control?","target":"Antisemitism"},{"hate_speech":"Jews think they are better than everyone else","knowledge_sentence":"is an essential part of being Jewish as observing Jewish law (19%).Despite those trends, American Jews overwhelmingly express pride in their Jewish identity and a \"strong sense of belonging to the Jewish people,\" the Pew study said.Just 15% of Jewish Americans say that being Jewish is mainly a religious matter.Instead, more than 60% of American Jews say being Jewish is \"mainly a matter of culture and identity,\" according to an extensive survey released Tuesday by the Pew Research Center.The survey showed much lower rates of religious observance among Jewish millennials, one of several trends that may worry Jewish leaders.The non-partisan research center says its survey is the most comprehensive national survey of American Jews since the National Jewish Population Survey in 2000-2001.","counter_narrative":"Even if it might have been true in the past (but is not) the pride in Jewish identity according to an extensive survey released by the Pew Research Center is falling in the US. In fact, the survey showed much lower rates of religious observance among Jewish millennials.","target":"Antisemitism"},{"hate_speech":"Jews control the banks, media, hollywood, even the u.s. government; jews have a secret plot to take over the world","knowledge_sentence":"“Hillary Clinton meets in secret with international banks to plot the destruction of U.S. sovereignty to enrich these global financial powers, her special interest friends and her donors,” Trump announced in West Palm Beach.As a Jew and an American, I am both afraid and ashamed.All these are old canards straight out of the phony “Protocols of the Elders of Zion,” conspiracy theories about wealthy, international Jewish bankers plotting to destroy the nation and take over the world, controlling politicians with their wealth or through the power of the media that they dominate (the “Jew York Times” is a commonplace in neo-Nazi parlance).All that suggests that the majority of Americans — unlike 50 years ago — no longer find such views acceptable.He wants to argue that Clinton does not have working people’s interests or African Americans’ interests at heart, and so he embraces a conspiracy theory that accuses her of undermining poor communities for her own economic advantage without realizing that this stereotype of the greedy Jewish landlord or merchant was a staple of anti-Semitic rhetoric.recently play on long-standing tropes used against Jews for decades or even centuries, and the echoes are unmistakable for many of Trump’s alt-right followers and for Jews who are familiar with the history of anti-Semitism.","counter_narrative":"Did you know that the “Jew York Times” is a commonplace in neo-Nazi jargon? Did you know that this stereotype of the greedy Jewish controllying the world was a staple of anti-Semitic rhetoric? Did you know that this is a long-standing tropes used against Jews for decades or even centuries, and its echoes are unmistakable from the history of anti-Semitism? Last but not least: did you know that the majority of Americans no longer find such views acceptable?","target":"Antisemitism"},{"hate_speech":"Jews are selfish, cheap and greedy.","knowledge_sentence":"Jewish tradition outlines three paths to help along this process of fixing our lives leading up to and during Yom Kippur: Tzedakah (Charity) - , we pray in the plural, asking for the good of all, not for our own personal needs.The mistakes, errors in judgement, and selfishness that got us in trouble last year, can be forgiven by humanity and God on Yom Kippur.Wearing white invokes the memory of the Holy Temple in Jerusalem, where the the High Priest in ancient days sought forgiveness for the Jewish nation 2000 years ago.Yom Kippur, the Day of Atonement, observed this year from sundown on Friday night, October 7th until nightfall on October 8th, and is the Most Awesome Day in the Jewish calendar.Rather, our actions and deeds affect each another and the whole world.","counter_narrative":"Did you know that Jewish tradition outlines three paths to help along the process of fixing one's lives leading up to Yom Kippur? The first and foremost is Tzedakah (Charity). People pray in the plural, asking for the good of all, not for one own personal needs... This is anything but selfishness.","target":"Antisemitism"},{"hate_speech":"Jews secretly control the world.","knowledge_sentence":"Escape, Israel urges the Jews of France.But Israeli leaders ought to pause before calling for a mass exodus of French Jews.Does it want the world to see fearful Jews fleeing from Europe en masse yet again?And we now live in a world where in recent months people have brooded unemotionally, almost nonchalantly, over the question of whether the Jews “have a future” in France.A government that never misses an opportunity to lecture the Western world about the pitfalls of surrendering to terrorism is proposing exactly that — surrender — to the Jews of France.The surge in attacks is well-documented, as is the declining sense of security of French Jews.","counter_narrative":"Did you know that Israel urged the Jews of France to escape on several occasions because of antisemitism upsurge? If they were to control the world how would this be possible? And if this mass escape has not happened, it is just because the world do not want to see fearful Jews fleeing from Europe en masse yet again.","target":"Antisemitism"},{"hate_speech":"Jews control the banks, media, hollywood, even the u.s. government; jews have a secret plot to take over the world","knowledge_sentence":"“Hillary Clinton meets in secret with international banks to plot the destruction of U.S. sovereignty to enrich these global financial powers, her special interest friends and her donors,” Trump announced in West Palm Beach.As a Jew and an American, I am both afraid and ashamed.All these are old canards straight out of the phony “Protocols of the Elders of Zion,” conspiracy theories about wealthy, international Jewish bankers plotting to destroy the nation and take over the world, controlling politicians with their wealth or through the power of the media that they dominate (the “Jew York Times” is a commonplace in neo-Nazi parlance).All that suggests that the majority of Americans — unlike 50 years ago — no longer find such views acceptable.He wants to argue that Clinton does not have working people’s interests or African Americans’ interests at heart, and so he embraces a conspiracy theory that accuses her of undermining poor communities for her own economic advantage without realizing that this stereotype of the greedy Jewish landlord or merchant was a staple of anti-Semitic rhetoric. recently play on long-standing tropes used against Jews for decades or even centuries, and the echoes are unmistakable for many of Trump’s alt-right followers and for Jews who are familiar with the history of anti-Semitism.","counter_narrative":"As an American, I am both afraid and ashamed. All these are old canards straight out of the phony “Protocols of the Elders of Zion,” conspiracy theories about wealthy, international Jewish bankers plotting to destroy the nation and take over the world, controlling politicians with their wealth.","target":"Antisemitism"},{"hate_speech":"Jews are different from non-Jews not because of their beliefs, but because of their physical nature. “Jewishness” and malevolence is inherited through blood.","knowledge_sentence":"Around the world there are Jews of color, Asian Jews, Jews of all kinds.The idea that Jews are white is not only ridiculous, it’s offensive to who we really are!Even in times when we participated fully in non-Jewish societies, we always knew that we stood with one foot in the mainstream, and one foot outside.My answer to her, and my answer for all American Jews during these Days of Awe, is that finding our true Jewish identity can begin by questioning our whiteness.But that young woman I spoke with this summer, and most of her young adult Jewish peers today, can hardly fathom being singled out, being treated as “other,” because of their Jewishness.We all know that the saga of Jews in America is a stunning success story.","counter_narrative":"Around the world there are Jews of color, Asian Jews, Jews of all kinds. The idea that Jews have a specific physical nature is not only ridiculous, it’s offensive to who they really are! Most of young adult Jewish today, can hardly fathom being singled out, being treated as “other,” because of their Jewishness.","target":"Antisemitism"},{"hate_speech":"Jews made the 9\/11 attack.","knowledge_sentence":"Had Jaruzelski opposed the use of anti-Semitism as a traditional scapegoat mechanism, he could have put an end to it a long time ago.''That is why the Western governments represent the interests of the Jews and the Masons.General Jaruzelski, who is the Prime Minister and Communist Party leader, was described as saying he would not permit hard-liners in either the party or the Solidarity union to jockey for advantage by exploiting Poland's anti-Semitic tradition.The Soviet camp is a barrier for the Jewish chauvinism and for its plans to conquer the world.''Samoobrona was quoted as saying, ''We relentlessly and obsessively continue the campaign against the Jews and the Masons.''Mr. Kosecki said Samoobrona's backers had been attacked by KOR, the Polish dissident group, which advised the Solidarity union.","counter_narrative":"Anti-Semitism as a traditional scapegoat mechanism, in this case to cover the flaws in Homeland Security mechanisms.","target":"Antisemitism"},{"hate_speech":"Jews control the banks, media, hollywood, even the u.s. government; jews have a secret plot to take over the world","knowledge_sentence":"“Hillary Clinton meets in secret with international banks to plot the destruction of U.S. sovereignty to enrich these global financial powers, her special interest friends and her donors,” Trump announced in West Palm Beach.As a Jew and an American, I am both afraid and ashamed.All these are old canards straight out of the phony “Protocols of the Elders of Zion,” conspiracy theories about wealthy, international Jewish bankers plotting to destroy the nation and take over the world, controlling politicians with their wealth or through the power of the media that they dominate (the “Jew York Times” is a commonplace in neo-Nazi parlance).All that suggests that the majority of Americans — unlike 50 years ago — no longer find such views acceptable.He wants to argue that Clinton does not have working people’s interests or African Americans’ interests at heart, and so he embraces a conspiracy theory that accuses her of undermining poor communities for her own economic advantage without realizing that this stereotype of the greedy Jewish landlord or merchant was a staple of anti-Semitic rhetoric.recently play on long-standing tropes used against Jews for decades or even centuries, and the echoes are unmistakable for many of Trump’s alt-right followers and for Jews who are familiar with the history of anti-Semitism.","counter_narrative":"All these are old canards straight out of the phony “Protocols of the Elders of Zion,” conspiracy theories about Jewish bankers plotting to destroy the nation and take over the world, controlling politicians with their wealth or through the power of the media that they dominate, in fact the “Jew York Times” is a commonplace in neo-Nazi parlance.","target":"Antisemitism"},{"hate_speech":"Go and reat the Protocols of the elders of Zion if you haven’t. Everything is orchestrated..","knowledge_sentence":"\"I'm Jewish, so maybe I'm sensitive to it, but it clearly has sort of an 'Elders of Zion' kind of feel to it,\" Franken said on CNN, referring to \"The Protocols of the Elders of Zion,\" an early 20th-century forged anti-Semitic text purporting to outline Jewish plans to run the world.\"So I think that it does speak to a certain part of his alt-right base — [Stephen] Bannon, who's head of Breitbart is his chairman.\"International banking crisis plot, or conspiracy, rather, and then a number of Jews,\" Franken said.From his personal Twitter account, the organization's chief executive, Jonathan Greenblatt, warned that rhetoric that has historically been used against Jews continues to spur anti-Semitism and called for keeping hate out of presidential politics.Trump has tweeted a lot of that sort of thing, and I think it's an appeal to some of the worst elements in our country.\"Video of Goldman Sachs Chief Executive Lloyd Blankfein, Federal Reserve Chairwoman Janet Yellen and billionaire donor George Soros, all of whom are Jewish, plays alongside the audio.","counter_narrative":"The Protocols of the Elders of Zion are an early 20th-century forged anti-Semitic text purporting to outline Jewish plans to run the world... International banking crisis plot, or conspiracy, rather, are the basic ingredients. This rhetoric that has historically been used against Jews continues to spur anti-Semitism.","target":"Antisemitism"},{"hate_speech":"Jews are Christ Killers.","knowledge_sentence":"Jesus Christ Superstar” may just be the right musical for you.Judas sings repeatedly of his disappointment at Jesus’ betrayal of his ideals.But the hungry looks Judas repeatedly casts suggest that sexual jealousy plays no small role in his decision to turn the object of his agonized affection over to the Roman rulers, to whom this “King of the Jews” is a prickly thorn in the side.The agonies of Jesus are terrible to behold, of course, but on a far more trivial level one of the agonies of “Jesus Christ Superstar” is the unhappy combination of Mr. Lloyd Webber’s stick-in-your-head melodies and the often flat-footed lyrics they are wedded to.After he has been dragged off by Roman thugs, hands bound and a look of sorrowful resignation on his face, Jesus (Paul Nolan) returns for a flogging, with each stroke of the lash counted down and represented by vivid red splashes streaking across the electronic back wall of the set.It will surely come as a surprise to no one that the title character in “Jesus Christ Superstar” does not come to a happy end, drifting blissfully into old age and obscurity on the sands of Judea.","counter_narrative":"Jesus Christ Superstar may just be the right musical for you, then.","target":"Antisemitism"},{"hate_speech":"Faggots abuse of their anus and then they want to clear their conscience by donating blood. Let's stop them!","knowledge_sentence":"The US will lift a lifetime ban on gay men donating their blood. Earlier this month, a panel of experts convened by US health regulators failed to recommend whether a lifetime ban should be lifted on gay men donating blood, following two days of heated deliberations.A growing number of medical and legal experts have argued that the existing restrictions are outdated, and that sophisticated tests for human immunodeficiency virus (HIV) exist that can make blood donation by gay men a much safer practice.The US Food and Drug Administration will move to ease a lifetime ban on blood donations from homosexual men, allowing them to give after a year of abstaining from sexual activity. \"The agency will take the necessary steps to recommend a change to the blood donor deferral period for men who have sex with men from indefinite deferral to one year since the last sexual contact\" said a statement from FDA Director Margaret Hamburg. The FDA said it made decision after reviewing scientific evidence in recent years  regarding its blood donor policy for homosexual males.","counter_narrative":"A growing number of medical and legal experts have argued that restrictions are useless: sophisticated tests for human immunodeficiency virus (HIV) exist that can make blood donation (also by gay men) a much safer practice.","target":"Homophobia"},{"hate_speech":"Gays are perverts and must be isolated from society because they are practicing anal sex and spreding diseases such as HIV.","knowledge_sentence":"\"We think the risk from condomless anal sex is low, but we need to ensure we have a couple years of follow up to give more precise estimates,\" she said. About 33 percent of gay participants and 4 percent of heterosexual participants who were HIV-negative at the start of the study reported condomless sex with other partners, the researchers write. Overall, the 548 heterosexual and 340 gay couples reported about 60,000 unprotected sex acts during the study. After following nearly 900 heterosexual and gay couples for an average of 16 months, researchers found no evidence that uninfected partners became infected after condomless sex with an HIV-positive partner with viral suppression. For example, he said, when the study started, many of the participants had been having condomless sex with their partners for several years. The new study, conducted in 14 European countries, involved couples with one HIV-positive partner and one HIV-negative partner who had unprotected sex with each other.","counter_narrative":"A recent study, conducted in 14 European countries, involved both heterosexual and gay couples with one HIV-positive partner and one HIV-negative partner who had unprotected sex with each other. Researchers found no evidence that uninfected partners became infected after condomless sex with an HIV-positive partner with viral suppression.","target":"Homophobia"},{"hate_speech":"LGBTs just want to brainwash our children. They should not be taught about gender identity and sexual orientation in school.","knowledge_sentence":"Last month, the federal Department of Education told schools they were obligated, under civil rights laws, to try to prevent harassment, including that based on sexual orientation and gender identity. Through his years in the Helena schools, he said at another school board meeting, sexual orientation was never once discussed in the classroom, and Last summer, school officials here in Montana’s capital unveiled new guidelines for teaching about sexuality and tolerance. While nearly all states require schools to have rules against harassment, only 10 require them to explicitly outlaw bullying related to sexual orientation. opposes the curriculum changes in the school district in Helena, Mont. The school district in Helena, Mont., revised its new teaching guidelines on sex education and tolerance, after parents criticized them as being too explicit and an endorsement of homosexuality.","counter_narrative":"According to basic civil rights, we must prevent harassment, including that based on sexual orientation and gender identity. Teaching about sexuality and tolerance is the only way.","target":"Homophobia"},{"hate_speech":"Allowing gays to donate blood compromises patient safety because of their sexual behavior that spreads diseases such as HIV. At least we should test them!","knowledge_sentence":"\"It's scientific that the policy doesn't mention homosexual identity but only fences off some who have certain sex behaviors, because AIDS is not caused by one's homosexual identity but improper sexual behavior,\" Xian told the Global Times. Campaigners push for marriage equality worldwide \"It is also about our dignity and the elimination of blood donation discrimination,\" she was quoted as saying. AIDS first made an appearance in China in the 1980s when an Argentinean tourist died from the disease while on holiday in the country. However, more recently, organizations such as UNAIDS, the joint United Nations program on HIV and AIDS, have commended the Chinese government on advancements in the attitude on AIDS. Xu, who goes by her nickname Xian, first tried to donate blood in 2008 after an earthquake in Sichuan Province, when she learned of the ban and began campaigning against it.","counter_narrative":"According to science, blood donation policies shouldn't mention homosexual identity but only fences off some who have certain sex behaviors, because AIDS is not caused by one's homosexual identity but improper sexual behavior.","target":"Homophobia"},{"hate_speech":"LGBTs just want to brainwash our children. They should not be taught about gender identity and sexual orientation in school.","knowledge_sentence":"Last month, the federal Department of Education told schools they were obligated, under civil rights laws, to try to prevent harassment, including that based on sexual orientation and gender identity. Through his years in the Helena schools, he said at another school board meeting, sexual orientation was never once discussed in the classroom, and Last summer, school officials here in Montana’s capital unveiled new guidelines for teaching about sexuality and tolerance. While nearly all states require schools to have rules against harassment, only 10 require them to explicitly outlaw bullying related to sexual orientation. opposes the curriculum changes in the school district in Helena, Mont. The school district in Helena, Mont., revised its new teaching guidelines on sex education and tolerance, after parents criticized them as being too explicit and an endorsement of homosexuality.","counter_narrative":"All schools should have rules against harassment, this includes outlaw bullying related to sexual orientation. But this implies teaching guidelines on sex education and tolerance.","target":"Homophobia"},{"hate_speech":"Gays are spreading AIDS all around the world because they are promiscuous and fornicate with strangers, and they lie when they want to donate blood.","knowledge_sentence":"\"Imported blood raises concern of AIDS to B.C. hemophiliacs. It would also discriminate against gays -- a contravention of International Red Cross policy. . The incidence of AIDS is much higher across the border, and there has been speculation that the little-understood but deadly disease can be transmitted through blood. Each dose of factor concentrate contains blood components from up to 20,000 different donors. . it was \"probably blood borne\" and outlined the high-risk groups that should not donate blood. It says the blood supply is safe -- and besides, blood is tested before it's used.","counter_narrative":"Apart from the prejudice against homosexual people, it is not true that diseases are being spred aroud. Blood supply is safe because blood is tested before it's used.","target":"Homophobia"},{"hate_speech":"LGBTs just want to brainwash our children. They should not be taught about gender identity and sexual orientation in school.","knowledge_sentence":"“Sexual orientation and gender identity terms will be discussed with focus on appreciation for individual differences.” “Students will be provided definitions for sexual orientation terms heterosexuality, homosexuality and bisexuality; and the gender identity term transgender,” Eighth graders will be taught that individual identity “occurs over a lifetime and includes the component of sexual orientation and gender identity.” Last week, the school board voted to include gender identity in the district’s nondiscrimination policy – a decision that was strongly opposed by parents. However, Torre told me that parents will indeed be able to opt out of those classes “including the sexual orientation and gender identity lessons.” “Individual identity will also be described as having four parts – biological gender, gender identity (includes transgender), gender role, and sexual orientation (includes heterosexual, bisexual, and homosexual).”","counter_narrative":"As long as sexual orientation and gender identity are discussed with focus on appreciation for individual differences, what is the problem?","target":"Homophobia"},{"hate_speech":"Children should learn about gender identity and sexual orientation from their families rather than in class from LGBT fundamentalist.","knowledge_sentence":"But acceptance and understanding can help all children grow up as confident, proud people, regardless of their gender identity. This month, the Dallas City Council unanimously approved an addition to their 2002 equal rights ordinance to prohibit discrimination on the basis of sexual orientation, gender identity and gender expression. The Houston Equal Rights Ordinance would’ve granted those who visit, live or work in Houston protection from “discrimination based on sex, race, color, ethnicity, national origin, age, familial status, marital status, military status, religion, disability, sexual orientation, genetic information, gender identity or pregnancy.” For children and teens struggling with gender dysphoria (a disconnect between a person’s sex at birth and their gender identity), high school can be even more hellish than it is for the general public. In gay culture, to “pass” means to fit into the heterosexual world without “detection” of your sexual orientation, and thus to avoid homophobic harassment or abuse. HERO opponents argued that by allowing transgender people to use the bathroom that corresponds to their gender identity, the ordinance would give men license to dress as women for the purpose of committing sexual assault in women’s restrooms.","counter_narrative":"But acceptance and understanding in school can help all children grow up as confident, proud people, regardless of their gender identity. For children and teens struggling with gender dysphoria (a disconnect between a person’s sex at birth and their gender identity), high school can be even more hellish than it is for the general public.","target":"Homophobia"},{"hate_speech":"Why gays do not try to heal?","knowledge_sentence":"And, contrary to Perry's insinuation, sexual orientation is not like a disease. More recent studies have identified other potential links between homosexuality and genetics, and scientists have offered explanations on how same-sex attraction could advance procreation. But finding the biological origins of same-sex attraction has the potential to undermine the rights of gays and lesbians. Why would a gene related to sexual orientation be useful? Studies of identical twins, who share the same genes, have shown that, if one twin is gay, the other is more likely to be gay, suggesting sexual orientation is influenced by genetics. Scientific studies have demonstrated that biology plays a role in one's sexual orientation.","counter_narrative":"Contrary to some insinuations, sexual orientation is not like a disease.","target":"Homophobia"},{"hate_speech":"Faggots abuse of their anus and then they want to clear their conscience by donating blood. Let's stop them!","knowledge_sentence":"Currently, gay men are prohibited from donating blood in the United States unless they are abstinent for one year. The FDA’s original ban on gay men donating blood was implemented as a means to prevent the spread of HIV through blood donations, back when there was not a simple way to detect HIV in blood. “The tragedy at Pulse nightclub in Orlando highlighted the discrimination gay and bisexual men face when attempting to donate blood to those in need.” “I am encouraged by today’s announcement that the FDA will look into policy solutions in order to move away from the discriminatory time-based deferrals and move closer to individual risk assessment as it relates to blood donor safety screenings,” Quigley said in a statement. Medical groups and legislators have called the ban discriminatory. The U.S. Food and Drug Administration on Tuesday posted a request for public comment on what alternative blood donor deferral policies could look like, signaling the possibility that longstanding restrictions on gay blood donations may be lifted.","counter_narrative":"Currently, gay men are already prohibited from donating blood in the United States unless they are abstinent for one year. Of course, medical groups and legislators have called the ban discriminatory: we MUST move closer to individual risk assessment rather than group discrimination policies.","target":"Homophobia"},{"hate_speech":"Faggots abuse of their anus and then they want to clear their conscience by donating blood. Let's stop them!","knowledge_sentence":"Currently, gay men are prohibited from donating blood in the United States unless they are abstinent for one year. The FDA’s original ban on gay men donating blood was implemented as a means to prevent the spread of HIV through blood donations, back when there was not a simple way to detect HIV in blood. “The tragedy at Pulse nightclub in Orlando highlighted the discrimination gay and bisexual men face when attempting to donate blood to those in need.” “I am encouraged by today’s announcement that the FDA will look into policy solutions in order to move away from the discriminatory time-based deferrals and move closer to individual risk assessment as it relates to blood donor safety screenings,” Quigley said in a statement. Medical groups and legislators have called the ban discriminatory. The U.S. Food and Drug Administration on Tuesday posted a request for public comment on what alternative blood donor deferral policies could look like, signaling the possibility that longstanding restrictions on gay blood donations may be lifted.","counter_narrative":"Currently, gay men are already prohibited from donating blood in the United States unless they are abstinent for one year. Still, FDA is looking into policy solutions to move away from the discriminatory time-based deferrals and move closer to individual risk assessment as it relates to blood donor safety screenings.","target":"Homophobia"},{"hate_speech":"We should restrain from imposing gender ideology on children.","knowledge_sentence":"The bishops voiced their official opinion in a pastoral letter posted online entitled, “Threats to the Family Stemming from the Ideology of Gender,” which proclaimed that “the aim of gender education is the sexualization of children and young people.” Posters have appeared in schools proclaiming, “Protect Your Child Against Gender.” In any case, the English word “gender” is hardly new to Poland. For two decades, the church hierarchy exhibited no interest in the “ideology of gender” until suddenly one day it began to speak of little else. “Gender” has been chosen as the 2013 word of the year in Poland. In any case, he didn’t have more to say about his statement, nor could he name any victims or give the number of people killed or maimed by the threat of gender.","counter_narrative":"Do you believe that there are \"threats to the family stemming from the ideology of gender”?In case, could you name any victims or give the number of people killed or maimed by the threat of gender? I give you a hint: zero. While there has been many victims of gender discrimination.","target":"Homophobia"},{"hate_speech":"LGBTs just want to brainwash our children. They should not be taught about gender identity and sexual orientation in school.","knowledge_sentence":"Some 91% of Fortune 500 companies already prohibit discrimination based on sexual orientation and 61% prohibit discrimination based on gender identity. The five top federal contractors–which get about a quarter of all federal contracting dollars–already prohibit discrimination based on sexual orientation and gender identity. The order protects any employee for a federal contractor from discrimination based on their sexual orientation and\/or gender identification. Many U.S. companies already offer protections for LGBT employees, according to data highlighted by the Obama Administration. Still, although many companies were already in support of protections, Obama’s order makes it official, and without exceptions. “It doesn’t make much sense, but today in America millions of our fellow citizens wake up and go to work with the awareness that they could lose their job, not because of anything they do or fail to do but because of who they are,” the president told supporters at the White House, CBS News reports.","counter_narrative":"Do you know that millions of our fellow citizens wake up and go to work every day with the awareness that they could lose their job, not because of anything they do or fail to do but because of who they are? Education in school is the only long term remedy.","target":"Homophobia"},{"hate_speech":"I hate gays","knowledge_sentence":"American gay activists have sent money to help the community here. Gays in Cameroon have been attacked by police and targeted in the media. Local newspapers are outing gays, potentially inciting the public to attack them, activists say. Western governments - including aid donors - have vocally criticized the bill and denounced the treatment of gays. They say their goal is to change the sexual behavior of gays, not to physically harm them. Gays have also been attacked this year in Zimbabwe, and in Senegal their graves have been desecrated.","counter_narrative":"Do you know that words have consequences, right? What if I told you that around the world gay are being attacked? In Cameroon for example they are targeted by police and the media. Local newspapers are outing gays, inciting the public to attack them. Gays have also been attacked this year in Zimbabwe, and in Senegal their graves have been desecrated. Is this what you really want?","target":"Homophobia"},{"hate_speech":"We cannot allow gay people to donate blood. They could spread their mental illness and make other people gay via blood donation.","knowledge_sentence":"He did more than any other one individual to make the gay civil rights movement possible, ending the classification of gay people as mentally ill and laying the foundation for the overturn of sodomy laws. Gay people had so little self-confidence at that time that they felt their only chance of gaining some tolerance was by asking psychiatrists to say that we were mentally ill and therefore should be pitied and given therapy instead of being incarcerated. As he said, \"In one fell swoop, 15 million gay people were cured!\" He and Mattachine Society of Washington co-founder Jack Nichols were passionate about the damage done by the American Psychiatric Association's classification of homosexuality as a mental illness. It was not, however, until four years after Kameny had founded the Mattachine Society of Washington that he could convince the organization he founded to take the official position that homosexuality is not a mental illness, making it the first gay organization to do so. And he led the fight for gay people to be able to serve in the military by, for example, creating the Leonard Matlovich case, the first case that got national media attention about the issue of gay people being able to serve in the military.","counter_narrative":"Do you know where the prejudice about \"Gay's mental illness\" comes from? During the fifties they had so little self-confidence and were so discriminated that they felt their only chance of gaining some tolerance was by asking psychiatrists to say that we were mentally ill and therefore should be pitied and given therapy instead of being incarcerated! That is the sad story.","target":"Homophobia"},{"hate_speech":"Children should not be taught about LGBT perversion. Families, due to their cultural or religious backgrounds, have the right to be against it.","knowledge_sentence":"“Our decision is rooted in the desire to be respectful of the many cultural and religious backgrounds represented by the students attending Centerville Elementary,” he wrote. Wenger said Lancaster County is a conservative area and has a rich history of religious liberty. In order to be tolerant and diverse, public schools have to eradicate any mention of God. But to be fair – the school administration says their decision was mostly because of the amount of time it took to produce the show (about 20 hours). He’s also a longtime resident of Lancaster County. “Charles Dickens is a class author, not a religious author.”","counter_narrative":"Families have the right to be against it: but in order to be tolerant and diverse, public schools have to remove any mention to a specific God.","target":"Homophobia"},{"hate_speech":"homosexuality is a mental illness that can be cured [link]","knowledge_sentence":"Despite Peter and Kenneth having lived through the years where being gay was considered a mental illness, their love and their life together survived and flourished. For more than 30 years, the major health and mental health professional organizations in the United States have agreed that heterosexuality, bisexuality and homosexuality are all variations of sexual orientation. In contrast, Minnesota congresswoman and presidential candidate Michele Bachmann and her husband, Marcus, have both publicly supported the proposition that homosexuality can be cured through therapy, prayer, or a combination of the two. Individuals who seek “reparative therapy” to become heterosexual often do so because of personal distress, possibly caused by family, or societal pressures, or by teachings from those religious traditions that condemn bisexuality and homosexuality. Can an individual’s sexual orientation be changed through therapy? There can be no justification for discrimination based on sexual orientation or gender identity, including the use of “reparative” therapies.","counter_narrative":"For more than 30 years, the major health and mental health professional organizations in the United States have agreed that heterosexuality, bisexuality and homosexuality are all variations of sexual orientation. In contrast, some politicians have publicly supported the proposition that homosexuality can be cured through therapy, prayer, or a combination of the two. Are you on the side of science or of politics?","target":"Homophobia"},{"hate_speech":"Why gays do not try to heal?","knowledge_sentence":"\"We are trying to make the Chinese public understand that we are not just sissies, we're not psychos, we're not HIV-infected diseased patients,\" Zhang told the Associated Press. The pageant was considered a move toward acceptance in a country where such a lifestyle was considered a crime and a disease, and only removed from the list of mental disorders as late as 2001. said they were not surprised the show was canceled, though the order came quite suddenly. and there were no problems and there is a still a general lack of tolerance among older Chinese generations. and no one came to give us any kind of warning,\" said contestant Emilio Liu, 26.","counter_narrative":"Homosexual are trying to make the public understand that they are not just sissies, they are not psychos or HIV-infected diseased patients. But I see they still have a long way to go...","target":"Homophobia"},{"hate_speech":"LGBTs just want to brainwash our children. They should not be taught about gender identity and sexual orientation in school.","knowledge_sentence":"“Sexual orientation and gender identity terms will be discussed with focus on appreciation for individual differences.” “Students will be provided definitions for sexual orientation terms heterosexuality, homosexuality and bisexuality; and the gender identity term transgender,” Eighth graders will be taught that individual identity “occurs over a lifetime and includes the component of sexual orientation and gender identity.” Last week, the school board voted to include gender identity in the district’s nondiscrimination policy – a decision that was strongly opposed by parents. However, Torre told me that parents will indeed be able to opt out of those classes “including the sexual orientation and gender identity lessons.” “Individual identity will also be described as having four parts – biological gender, gender identity (includes transgender), gender role, and sexual orientation (includes heterosexual, bisexual, and homosexual).”","counter_narrative":"If gender identity is taught to foster nondiscrimination policy and parents are indeed able to opt out of those classes, what is the problem?","target":"Homophobia"},{"hate_speech":"Children are not for rent","knowledge_sentence":"“Gestational surrogate pregnancy contracts should be a viable option for potential parents. With medical advances, nearly all test-tube surrogate births today are done through gestational pregnancy. law is outdated and discriminates against couples who want to have children. Opponents claim gestational pregnancy exploits women and shows that modern medicine has run amok. “There’s interest from more and more couples to pursue gestational surrogacy as an option to have children.”A bill called the Child-Parent Security Act, which has been introduced by state Sen. Brad Hoylman (D-Manhattan) and Assemblywoman Amy Paulin (D-Westchester), would legalize surrogacy through gestational pregnancies, in which a woman is paid to go through the pregnancy and deliver a child who is not genetically related — a practice opponents slam as “womb for rent.”","counter_narrative":"In my opinion, so called \"Gestational surrogate pregnancy\" contracts should be a viable option for potential parents. Some laws are outdated and discriminates against couples who want to have children but cannot. And this is not necessarly connected to same-sex couples, of course.","target":"Homophobia"},{"hate_speech":"homosexuality is a mental illness that can be cured [link]","knowledge_sentence":"Despite Peter and Kenneth having lived through the years where being gay was considered a mental illness, their love and their life together survived and flourished. For more than 30 years, the major health and mental health professional organizations in the United States have agreed that heterosexuality, bisexuality and homosexuality are all variations of sexual orientation. In contrast, Minnesota congresswoman and presidential candidate Michele Bachmann and her husband, Marcus, have both publicly supported the proposition that homosexuality can be cured through therapy, prayer, or a combination of the two. Individuals who seek “reparative therapy” to become heterosexual often do so because of personal distress, possibly caused by family, or societal pressures, or by teachings from those religious traditions that condemn bisexuality and homosexuality. Can an individual’s sexual orientation be changed through therapy? There can be no justification for discrimination based on sexual orientation or gender identity, including the use of “reparative” therapies.","counter_narrative":"Individuals who seek “reparative therapy” to become heterosexual often do so because of personal distress, possibly caused by family, or societal pressures, or by teachings from those religious traditions that condemn bisexuality and homosexuality. But individual’s sexual orientation cannot be changed through therapy. And there can be no justification for discrimination based on sexual orientation or gender identity, including the use of “reparative” therapies.","target":"Homophobia"},{"hate_speech":"Allowing gays to donate blood compromises patient safety because of their sexual behavior that spreads diseases such as HIV.","knowledge_sentence":"The U.S. blood supply is facing new safety threats, exposing patients to potentially greater risk of disease from transfusions. One fear is that a major new blood-borne disease in the U.S. could have an impact similar to the AIDS epidemic in the early 1980s, when more than 14,000 people acquired the disease from blood transfusions before donated blood was tested for HIV starting in 1985. “But transfusions have risks, and they can transmit infectious disease and cause reactions. “Blood saves lives,” says Matthew Kuehnert, director of the Office of Blood, Organ and Other Tissue Safety for the Centers for Disease Control and Prevention. Pathogen-reduction technology offers an insurance policy of sorts, inactivating some transfusion threats without damaging blood components. Even with its limitations, pathogen reduction allows blood centers to be more “proactive” about reducing disease threats, and could reduce costs by eliminating the need for some testing, according to Edward Snyder, a professor of laboratory medicine at Yale School of Medicine and director of transfusion services at Yale-New Haven Hospital.","counter_narrative":"Instead of focusing on long standing misconceptions (i.e. gays equal HIV), why don't we use pathogen-reduction technology that can inactivate some transfusion threats without damaging blood components? Even with its limitations, pathogen reduction allows blood centers to be more “proactive” about reducing disease threats and allow more people to be eligible for blood donation. I think this is a much fairer approach.","target":"Homophobia"},{"hate_speech":"Allowing gays to donate blood compromises patient safety because of their sexual behavior that spreads diseases such as HIV.","knowledge_sentence":"Some MSMs will remain celibate and be able to donate blood. For a Year to Donate Blood Italy and Spain have switched to a similar system for blood donations, which determines eligibility based on behavioral factors like intravenous drug use and unprotected sex, without an outbreak of infectious diseases in the blood supply. Florida Man Feels 'Helpless' After Failed Blood Donation Attempt It carries forward the false notion that HIV is a gay disease. The FDA, which regulates donation guidelines, sets its blood and tissue recommendations separately.","counter_narrative":"It is a false notion that HIV is a gay disease. We should follow Italy and Spain example: they have switched to a similar and safer system for blood donations, which determines eligibility based on behavioral factors like intravenous drug use and unprotected sex.","target":"Homophobia"},{"hate_speech":"We should eliminate gays.","knowledge_sentence":"\"Here, homosexuality is like you have killed someone,\" she said. \"You are talking about a clash of cultures. American gay activists have sent money to help the community here. Local newspapers are outing gays, potentially inciting the public to attack them, activists say. They say their goal is to change the sexual behavior of gays, not to physically harm them. In Gambia, President Yahya Jammeh has vowed to expel gays from the country and urged citizens not to rent homes to them.","counter_narrative":"It seems that homosexuality is like you have killed someone. Instead it is a personal choice that does not affect others.","target":"Homophobia"},{"hate_speech":"Gays are just sick. They cannot marry. It is an abomination","knowledge_sentence":"\"In Uganda, we look at homosexuality as an abomination. American gay activists have sent money to help the community here. Gays in Cameroon have been attacked by police and targeted in the media. Local newspapers are outing gays, potentially inciting the public to attack them, activists say. Western governments - including aid donors - have vocally criticized the bill and denounced the treatment of gays. They say their goal is to change the sexual behavior of gays, not to physically harm them.","counter_narrative":"Maybe you are one of those persons that says: \"my goal is to change the sexual behavior of gays, not to physically harm them\". But the result of your words is just inciting the public to attack them.","target":"Homophobia"},{"hate_speech":"Allowing gays to donate blood compromises patient safety because of their sexual behavior that spreads diseases such as HIV.","knowledge_sentence":"In a joint statement, the blood organizations said that safety was the first priority and that potential donors should be screened more fairly, regardless of sexual orientation. Shawn Decker, a hemophiliac who contracted HIV through contaminated blood products, said he supports allowing gay men to donate blood. The different standards between gay and straight people exists because the risk of HIV is much lower in heterosexuals, he said. The Human Rights Campaign, the American Red Cross, America's Blood Centers and AABB, formerly known as the American Association of Blood Banks, support easing the lifetime ban to allow gay blood donors. The issue of blood donation has \"nothing to do with someone being gay. The FDA retained the ban on gay blood donors after reviewing the issue in 2000 and 2006.","counter_narrative":"Of course safety is the first priority, but potential donors should be screened more fairly, regardless of sexual orientation: it's the sexual behavior the real issue.","target":"Homophobia"},{"hate_speech":"Allowing gays to donate blood compromises patient safety and testing all gay donors would be too expensive.","knowledge_sentence":"The FDA screens all potential donors based on risk factors, blood testing for signs of infection and inventory control. The FDA screens all potential blood donors based on risk factors and signs of infections. Yezak is urging gay and bisexual men on Friday to visit designated blood donation centers, where a mobile HIV testing center will be located. Parts of UK to lift lifetime ban on gay men donating blood At the time, there wasn't a good test to detect whether HIV was present in donated blood, and HIV was getting into the nation's blood supply. He said he wants to convey on a national level how much blood the gay community could potentially contribute to the blood supply if given a chance to donate.","counter_narrative":"Once, there wasn't a good and cheap test to detect whether HIV was present in donated blood, and HIV was getting into the nation's blood supply. But now that there is, we must ask ourselves: how much blood the gay community could potentially contribute to the blood supply if given a chance to donate?","target":"Homophobia"},{"hate_speech":"Gays are just sick. It is an abomination","knowledge_sentence":"\"In Uganda, we look at homosexuality as an abomination. \"Here, homosexuality is like you have killed someone,\" she said. American gay activists have sent money to help the community here. Gays in Cameroon have been attacked by police and targeted in the media. Local newspapers are outing gays, potentially inciting the public to attack them, activists say. Western governments - including aid donors - have vocally criticized the bill and denounced the treatment of gays.","counter_narrative":"Only in some underdeveloped countries they look at homosexuality as an abomination, like you have killed someone. Only in some underdeveloped countries gays have been attacked by police and targeted in the media. Is this what you want?","target":"Homophobia"},{"hate_speech":"Gays are just sick. It is an abomination","knowledge_sentence":"\"In Uganda, we look at homosexuality as an abomination. More than two-thirds of African countries have laws criminalizing homosexuality. The growing tide of homophobia comes at a time when gays in Africa are expressing themselves more openly, prompting greater media attention and debates about homosexuality. Western governments - including aid donors - have vocally criticized the bill and denounced the treatment of gays. That has angered conservative pastors here, many of whom are influenced by American anti-gay Christian groups and politicians who say that African values are under attack by Western attitudes. In May, a judge in Malawi imposed a maximum prison sentence of 14 years with hard labor on a gay couple convicted of \"unnatural acts\" for holding an engagement ceremony.","counter_narrative":"So you are in favour of laws criminalizing homosexuality, right? So you are in favour of giving a prison sentence of 14 years with hard labor on a gay couple convicted of \"unnatural acts\" just for holding an engagement ceremony? Is this what you are in favour of?","target":"Homophobia"},{"hate_speech":"LGBTs just want to brainwash our children. They should not be taught about gender identity and sexual orientation in school, they'll end up being bullied.","knowledge_sentence":"Reuters quoted Power on Monday saying the vote was rooted in \"disagreement over whether people of a certain sexual orientation and gender identity are in fact entitled to equal rights.\" Ntwaagae also referred to sexual orientation and gender identity as \"non-internationally agreed notions\" that should not be given attention at the U.N. to the \"detriment of issues of paramount importance, such as the right to development and the racism agenda.\" On Monday morning, the United Nations was split almost down the middle in a vote on whether or not to keep the Independent Expert on Sexual Orientation and Gender Identity.At the time, Botswana's U.N. Ambassador Charles Ntwaagae spoke for the 54-member Africa group, saying that sexual orientation and gender identity \"are not and should not be linked to existing international human rights instruments.\" In November, African states circulated a draft resolution at the U.N.'s General Assembly third committee, calling for more clarification around the mandate of the LGBTQ investigator—and demanding that the position be halted pending further inquiry. \"Once more, States have reaffirmed the importance of monitoring human rights violations against people on the basis of their sexual orientation and gender identity,\" said ILGA's co-Secretaries General Helen Kennedy and Ruth Baldacchino, who called the appointment \"a crucial leap towards a world where all are treated free and equal.","counter_narrative":"So you think that people of a certain sexual orientation and gender identity are not entitled to equal rights? Shouldn't we make a leap towards a world where all are treated free and equal, and bullies are rendered harmless?","target":"Homophobia"},{"hate_speech":"I hate gays","knowledge_sentence":"American gay activists have sent money to help the community here. Gays in Cameroon have been attacked by police and targeted in the media. Local newspapers are outing gays, potentially inciting the public to attack them, activists say. Western governments - including aid donors - have vocally criticized the bill and denounced the treatment of gays. They say their goal is to change the sexual behavior of gays, not to physically harm them. Gays have also been attacked this year in Zimbabwe, and in Senegal their graves have been desecrated.","counter_narrative":"Some says their goal is to change the sexual behavior of gays, not to physically harm them. But in the end gays are being discriminated and attacked in many places around the world. The words you said do not help in making the world a better place.","target":"Homophobia"},{"hate_speech":"Gays are perverts and must be isolated from society because they are practicing anal sex and spreding diseases such as HIV.","knowledge_sentence":"\"We think the risk from condomless anal sex is low, but we need to ensure we have a couple years of follow up to give more precise estimates,\" she said. About 33 percent of gay participants and 4 percent of heterosexual participants who were HIV-negative at the start of the study reported condomless sex with other partners, the researchers write. Overall, the 548 heterosexual and 340 gay couples reported about 60,000 unprotected sex acts during the study. After following nearly 900 heterosexual and gay couples for an average of 16 months, researchers found no evidence that uninfected partners became infected after condomless sex with an HIV-positive partner with viral suppression. For example, he said, when the study started, many of the participants had been having condomless sex with their partners for several years. The new study, conducted in 14 European countries, involved couples with one HIV-positive partner and one HIV-negative partner who had unprotected sex with each other.","counter_narrative":"Some studies show that the risk from condomless anal sex is low. Researchers found no evidence that uninfected partners became infected after condomless sex with an HIV-positive partner with viral suppression.","target":"Homophobia"},{"hate_speech":"Gays are spreading AIDS all around the world because they are promiscuous and fornicate with strangers, we should prevent them to make blood donations.","knowledge_sentence":"He also discussed a website that encourages random sex by gay men with strangers.\" gay guys are the horniest people in the world. \"Paris Hilton is a huge supporter of the gay community and would never purposefully make any negative statements about anyone’s sexual orientation.” claiming, \"Gay guys are the horniest people in the world ... \"The conversation became heated, after a close gay friend told her in a cab ride, a story about a gay man who has AIDS and is knowingly having unprotected sex. The comments were to express that it is dangerous for anyone to have unprotected sex that could lead to a life threatening disease.\"","counter_narrative":"The real issue is unprotected sex. Regardless of sexual orientation, it is dangerous for anyone to have unprotected sex that could lead to a life threatening disease.","target":"Homophobia"},{"hate_speech":"Gays are perverts and must be isolated from society because they are practicing anal sex and spreding diseases such as HIV.","knowledge_sentence":"\"We think the risk from condomless anal sex is low, but we need to ensure we have a couple years of follow up to give more precise estimates,\" she said. About 33 percent of gay participants and 4 percent of heterosexual participants who were HIV-negative at the start of the study reported condomless sex with other partners, the researchers write. Overall, the 548 heterosexual and 340 gay couples reported about 60,000 unprotected sex acts during the study. After following nearly 900 heterosexual and gay couples for an average of 16 months, researchers found no evidence that uninfected partners became infected after condomless sex with an HIV-positive partner with viral suppression. For example, he said, when the study started, many of the participants had been having condomless sex with their partners for several years. The new study, conducted in 14 European countries, involved couples with one HIV-positive partner and one HIV-negative partner who had unprotected sex with each other.","counter_narrative":"The risk from condomless anal sex is low. In a study with 548 heterosexual and 340 gay couples, about 60,000 unprotected sex acts were reported. After following the couples for an average of 16 months, researchers found no evidence that uninfected partners became infected after condomless sex with an HIV-positive partner.","target":"Homophobia"},{"hate_speech":"Allowing gays to donate blood compromises patient safety because of the diseases they can transmit.","knowledge_sentence":"\"This is an issue that relates to safety in the blood supply. Shawn Decker, a hemophiliac who contracted HIV through contaminated blood products, said he supports allowing gay men to donate blood. The Federal Advisory Committee on Blood Safety and Availability will consider the issue in meetings June 10 and 11 in Rockville, Maryland. The issue of blood donation has \"nothing to do with someone being gay. Blood donation questions and answers The FDA retained the ban on gay blood donors after reviewing the issue in 2000 and 2006.","counter_narrative":"This is an issue that relates to safety in the blood supply, not to being gay. For example, Shawn Decker, a hemophiliac who contracted HIV through contaminated blood products, said he supports allowing gay men to donate blood, exaclty for this reason.","target":"Homophobia"},{"hate_speech":"Why gays do not try to heal?","knowledge_sentence":"We must always consider the person. it is not possible to interfere spiritually in the life of a person.” In life, God accompanies persons, and we must accompany them, starting from their situation. A person once asked me, in a provocative manner, if I approved of homosexuality. “The Jesuit must be a person whose thought is incomplete, in the sense of open-ended thinking,” he said. I said that if a homosexual person is of good will and is in search of God, I am no one to judge.","counter_narrative":"We must always consider the person. it is not possible to interfere in the personal preferences of a person. If a homosexual person is of good will, I am no one to judge or to try to heal them.","target":"Homophobia"},{"hate_speech":"Fagshit, two men cannot replace a father and a mother","knowledge_sentence":"Or research from the Australian Study of Child Health in Same-Sex Families from last year. But let’s stick to the statistics Reed used to buttress his claim against same-sex parents. And even though Obama’s focus is and has always been on fathers, Reed tossed out those stats to put down same-sex parents. Of gay parents? Raddatz then asked Reed, “Would you rather have a child sitting in an orphanage and not have gay parents?” His response: “I think that the social science is just simply not in yet on same-sex couples and","counter_narrative":"Would you rather have a child sitting in an orphanage and not have gay parents?","target":"Homophobia"},{"hate_speech":"Fagshit, two men cannot replace a father and a mother","knowledge_sentence":"As a result, the mothers benefit, the fathers benefit, the babies benefit, and a family’s bottom line benefits. Specifically, the plan offers 12 weeks of leave for new birth mothers and six weeks for dads and adoptive parents. Cultural biases about men, work, and family make it uncomfortable for many to actually take the leave when they’re given it: A recent survey by Deloitte found that “54% of survey respondents said they think their colleagues would judge a father who took the same amount of parental leave as a mother.” A federal policy that completely excludes men from guaranteed paid parental leave perpetuates out-of-date attitudes about family and work. A 2012 Department of Labor study found that “only 13% of men who took parental leave received pay compared with 21% for women.” “Traditional gender responsibilities at work and home are evolving and resulting in the need for more progressive parental leave policies to better support women and men in the workplace,” Karyn Twaronite, EY Global Diversity & Inclusiveness Officer, said in a press release at the time.","counter_narrative":"You are completely right, I understand your concern: given the cultural biases about men, work, and family none of the two fathers would take the leave when they’re given it and the baby would be left home alone...","target":"Homophobia"},{"hate_speech":"LGBTs just want to brainwash our children. They should not be taught about gender identity and sexual orientation in school.","knowledge_sentence":"Violence against lesbians in Kenya is not uncommon, and laws still exist that can criminalize individuals based on their sexual orientation and gender identity. \"I wanted to focus on the common threads that exist within the LGBT community, despite the differences in sexual orientation, community borders and gender identification,\" she explained. Wanjala is representative of a growing number of artist globally who are using their art as a way to not only bring visibility to issues regarding sexual orientation and gender identity, but also spark a dialogue that can help challenge long held prejudices and stereotypes held against those who identify as LGBT. Wanjala's most recent show, held at artists' space Creative Garage in Nairobi, was her first to touch on themes of her sexual orientation. the risks she takes as an artist will help promote more understanding and acceptance of those who identify as a sexual minority in Kenya. Also included in the show was a video installation discussing the stereotypes faced by women who live outside what is considered to be the heteronormative norm in Kenya.","counter_narrative":"You should know artists such as Wanjala: she is representative of a growing number of artist globally who are using their art as a way to not only bring visibility to issues regarding sexual orientation and gender identity, but also spark a dialogue that can help challenge long held prejudices and stereotypes held against those who identify as LGBT. Maybe you would change your mind.","target":"Homophobia"},{"hate_speech":"Don't call Islam a peaceful religion. Consult the evidence on Muslim child rapists. Children were raped by more than 10 people in a night, up to 100 in a week. Why is the media ignoring this?","knowledge_sentence":"In an appearance Sunday on ABC's This Week, Walker didn't address religion when he said he's open to sending U.S. troops to the Middle East to fight the Islamic State in a “surgical” operation.They were given two choices: “Islam is an inherently violent religion, which leads its followers to violent acts” and “Islam is an inherently peaceful religion, but there are some who twist its teachings to justify violence.”Taking the opposite view from Coffey was Alex Bellings, 27, a customer-service worker from Coralville and likely Republican caucus-goer who sees Islam as a peaceful religion.Santorum added that “I'm not saying that all Muslims are terrorists, nor do I say that all Muslims support terrorism,” but that in his view the threat from Islamic terrorists to the U.S. is “rooted in the belief in an all-powerful God and has over a billion adherents who are taught that their faith supersedes all other faith.In one form or another, Islam has been warring with western civilization for 1,300 years.”Imam Johari Adbul-Malik, the outreach director at Dar Al-Hijrah Islamic Center in Falls Church, Va., said he was encouraged by the fact that majorities in both parties considered Islam to be peaceful.","counter_narrative":"You are given two choices: “Islam is an inherently violent religion, which leads its followers to violent acts” and “Islam is an inherently peaceful religion, but there are some who twist its teachings to justify violence.” I prefer the second interpretation.","target":"Islamophobia"},{"hate_speech":"Islam is a just a repressive ideology that persecutes women and gay people.","knowledge_sentence":"Women are not slabs of meat in Islam.Well, under the Islamic State -- under the Islamic State, people will not be doing this relationship in the public arena.tortured people, tortured people for over 10 years in Guantanamo Bay.Should gay people... What about gay people?They are honored in Islam.","counter_narrative":"Women are not slabs of meat in Islam.","target":"Islamophobia"},{"hate_speech":"All Muslims are incompatible with any Western society.","knowledge_sentence":"The United Methodist Church, for example, formally considers homosexuality incompatible with Christian doctrine.To read more about religious denominations’ policies, practices and tolerance for diversity in the post-Prop. 8 world, click here.’s practice doesn’t necessarily follow its policy.There’s also an organization called Muslims for Progressive Values that dispatches imams around the country to perform Islamic weddings for gays and lesbians, even though mainstream Islam condemns homosexuality.Gay and lesbian couples who want a religious wedding, may be surprised that a church But 82 Methodist ministers signed a statement last week saying they were prepared to perform same-sex weddings at any Methodist church that lacked a pastor.","counter_narrative":"Why do you say that ALL Muslims are incompatible with any Western society? Because they condemn homosexuality? Did you know that there’s also an organization called Muslims for Progressive Values that dispatches imams around the country to perform Islamic weddings for gays and lesbians?","target":"Islamophobia"},{"hate_speech":"It is obvious that this girl is at risk of FGM. Her parents are Muslims!","knowledge_sentence":"1 FLR 571, 573, 576, that male circumcision does involve harm, or the risk of harm.The fact that it may be a “cultural” practice does not make FGM reasonable; indeed, the proposition is specifically negatived by section 1(5) of the 2003 Act.It is at this point in the analysis, as it seems to me, that the clear distinction between FGM and male circumcision appears.FGM has no basis in any religion; male circumcision is often performed for religious reasons.In my judgment, any form of FGM constitutes “significant harm” within the meaning of section[] 31 …. So, he submits, it can never be reasonable parenting to inflict any form of FGM on a child.","counter_narrative":"While male circumcision is often performed for religious reasons, FGM has no basis in any religion, so the religion of her parents has nothing to do with this cruelty.","target":"Islamophobia"},{"hate_speech":"Not all Muslims are terrorists, but all terrorists are Muslims.","knowledge_sentence":"Anthea Butler, professor of religious studies Following Ted Cruz’s logic, Christians can never be terrorists after the crusades, and Muslims always are terrorists.While ideological violence is not a leading threat to public safety in the U.S., in recent years, right-wing extremists have killed as many people in the U.S. as Muslim extremists, and possibly more.Conflating a reader of Al Qaeda texts with the 9\/11 plotters demonizes Muslims.Thomas M. Sanderson, Center for Strategic and International Studies The F.B.I. is investigating 900 Americans for links to ISIS, which has plied locally based followers with visions of revenge.Arie Perliger, U.S. Military Academy Including all mass shootings under one umbrella of “terrorism” leads to a lack of understanding of their unique nature, which can result in imprecise and inadequate counter policies.","counter_narrative":"While ideological violence is not a leading threat to public safety in the U.S., in recent years, right-wing extremists have killed as many people in the U.S. as Muslim extremists, and possibly more. Conflating a reader of the Quran with the 9\/11 plotters demonizes Muslims.","target":"Islamophobia"},{"hate_speech":"Every Muslim is a potential terrorist.","knowledge_sentence":"The overwhelming majority of Muslims rejected and denounced the film that insulted the Prophet Muhammad.Some 1.5 billion Muslims worldwide are being depicted and characterized by tens of thousands of angry protesters.Here is another fact: the overwhelming majority of Muslims did not participate in protests, take to the streets or attack embassies or restaurants.Lebanon has seen its share of ant-film protests.The initial wave of protests was deadly, destructive and disruptive.Since the emergence of an insulting anti-Islam film surfaced last week, a wave of frenzy has swept the Muslim world at large and the Arab world in specific.","counter_narrative":"When the movie against the prophet was aired, 1.5 billion Muslims worldwide were being depicted and characterized by the actions of tens of thousands of angry protesters. Here is another fact: the overwhelming majority of Muslims did not participate in protests, take to the streets or attack embassies or restaurants. This is not an overwhelming majority of Muslims potential terrorists.","target":"Islamophobia"},{"hate_speech":"Islam is just a moon cult masquerading as a religion.","knowledge_sentence":"Not an Islamic cult.Dean is hardly the first public figure to try and separate modern-day Muslim extremists from the religion of Islam.I think it's a cult.I think ISIS is a cult.Islamic is the wrong word -- radical religious extremists,\" he clarified.He called them a \"militant cult masquerading as a religious movement.\"","counter_narrative":"We should try to separate modern-day Muslim extremists from the religion of Islam. ISIS is a cult. Islam is not. Islamic is the wrong word -- radical religious extremists is the right word. ISIS is a militant cult masquerading as a religious movement.","target":"Islamophobia"},{"hate_speech":"We must not believe the liberal and political elite. Islam is no good, its complete evil, and an ideology of war and it was always like this. All Muslims are bound to fight against us, and that is what they do through deception and violence.","knowledge_sentence":"In a few cases, people accused of hate crimes against Muslims and others have even cited Mr. Trump.“We see criminal threats against mosques; harassment in schools; and reports of violence targeting Muslim-Americans, Sikhs, people of Arab or South-Asian descent and people perceived to be members of these groups,” Ms. Gupta said.In the killing last year of three Muslim students in Chapel Hill, N.C., for instance, the authorities did not bring hate crime charges against a neighbor who is charged with murdering them, despite calls from Muslims who said there were religious overtones to the violence.The latest major episode of anti-Muslim violence came last weekend, when an arsonist on a motorcycle started a fire that engulfed the Islamic Center of Fort Pierce, Fla., where Omar Mateen — the gunman in the June massacre at the Pulse nightclub in Orlando — had sometimes prayed.The increase in reports of apparent hate crimes has worried Justice Department officials.One exception was hate crimes against transgender people, which rose about 40 percent.","counter_narrative":"We see criminal threats against mosques; harassment in schools; and reports of violence targeting Muslim-Americans... BUT Islam is an ideology of war. In the killing of three Muslim students in Chapel Hill, N.C., there was a clear hate crime from the neighbor who is charged with murdering them... BUT Islam is an ideology of war. An arsonist on a motorcycle started a fire that engulfed the Islamic Center of Fort Pierce, Fla... BUT Islam is an ideology of war.","target":"Islamophobia"},{"hate_speech":"Muslims have nothing to contribute to our society.","knowledge_sentence":"But this prejudice decreased as knowledge of Islam increased.The research found 41 per cent of people agreed or were undecided that Muslims \"do not fit\" Australian society. \" In the wake of the recent Essential poll, which showed that 49 per cent of Australians support a ban on Muslim immigration, this result is particularly heartening and important because it suggests that education and knowledge of Islam is key to overcoming Islamophobia and building a more cohesive society,\" Dr Vergani said.Mr Akbarzadeh said relentless questioning and negative portrayal of young Muslims will see them \"gravitate away from the mainstream Australian culture that rejects them\" and vulnerable to extremist groups such as Islamic State.More than a third of them agreed with statements such as \"practising Muslims pose a threat to Australian society\" (40.4 per cent) and \"practising Muslims should be searched more thoroughly than others in airports and stations\" (36.5 per cent).The participants - who were not asked for their religious background - said they would be much less worried if a relative married someone with Jewish (33 per cent), Buddhist (29.4 per cent) or Christian (8.1 per cent) background.","counter_narrative":"Usually this prejudice decreases as knowledge of Islam increases. A research found 41 per cent of people agreed or were undecided that Muslims \"do not fit\" Australian society. In the wake of the previous Essential poll, which showed that 49 per cent of Australians support a ban on Muslim immigration, this result was particularly heartening and important because it suggests that education and knowledge of Islam is key to overcoming Islamophobia and building a more cohesive society.","target":"Islamophobia"},{"hate_speech":"Go fuck yourselves disgusting Muslims! You wont marry my kids or grandchildren, we all hate you!","knowledge_sentence":"a muslim, Im not terrorist.To those who are already blaming the Muslim community; your anger is misguided and ignorant, to put it politely.I am not Muslim, but I support this trend.I am a proud Muslim who stands with Paris today.why do we, kids have to educate adults age of our parents.A handful of violent Muslims DO NOT speak for the other 1.6 billion.","counter_narrative":"To those who are blaming and hating the Muslim community; your anger is misguided. I am not Muslim, but I support them when discriminated. They are part of our society: there were many proud Muslims standing with Paris after the terrorist attacks. Last but not least: a handful of violent Muslims DO NOT speak for the other 1.6 billion.","target":"Islamophobia"},{"hate_speech":"Muslims demand locals to not walk their dogs in public because it's againt the Sharia and they feel it as disrespectful.","knowledge_sentence":"s call to bar Muslims from entering the country got all the attention, but an even uglier thread of anti-Muslim bigotry exists inside Ted Cruz’s campaign. selections reflects the different yardstick we apply to anti-Muslim views in contrast to bias against other minorities.Though Cruz’s campaign has the clearest connections, it is not alone in having associations with the anti-Muslim advocates.Or maybe he just has a selective memory about what he was taught as a young Muslim student in Indonesia.He’s also declared that Christians should “go on the offensive” to prevent Muslims in America from building any more mosques.Experts overwhelmingly agree that the kind of policies promoted by the anti-Islam noise machine — such as Cruz’s call for surveillance and special police patrols in Muslim neighborhoods, or Trump’s proposed ban on Muslims entering the country — will not lead to more effective counterterrorism efforts.","counter_narrative":"This selective attention to Muslims reflects the different yardstick we apply to Muslim in contrast to other minorities. Experts overwhelmingly agree that the kind of policies promoted by the anti-Islam noise machine will not lead to more effective integration.","target":"Islamophobia"},{"hate_speech":"Muslims are guilty in the sexual exploitation of children. Dirty filthy muslims terrorize our girls, today in Oxford, tomorrow everywhere.","knowledge_sentence":"\"All of the respondents clearly stated that they felt that the scale of the problem affected over half of the girls in their locations,\" it said.Save the Children said that work would be undermined if widespread sexual exploitation of children continued unchecked. MONROVIA, Liberia, May 8 -- Sexual exploitation of young girls is rife in refugee camps and communities in war-ravaged Liberia and threatens the country's recovery after nearly two decades of conflict, according to a report released Monday.The organization called on Liberia's new government, U.N. agencies and donors to set up an ombudsman's office to ensure that cases of sexual exploitation against children are investigated and to promote a policy of zero tolerance.International donors, aid agencies and nongovernmental organizations should ensure that their own staff and those of any local partner organizations enforced a strict code of conduct, the report said, and countries that contribute troops to the U.N. force should remove soldiers found guilty of sexually exploiting children.said an alarming number of girls as young as 8 were having sex with older men, including policemen, teachers, aid workers and U.N. peacekeepers, in exchange for money, food or favors such as a ride in a car or watching a film.","counter_narrative":"This is a problem with individuals, not groups. Did you know about sexual exploitation of children by \"Western civilized people\"? Save the Children said that there was a widespread sexual exploitation of children in Liberia. -- Sexual exploitation of young girls is rife in refugee camps and communities in war-ravaged Liberia and threatens the country's recovery after nearly two decades of conflict, according to Save the Children report. An alarming number of girls as young as 8 were having sex with older men, including policemen, teachers, aid workers and U.N. peacekeepers, in exchange for money, food or favors such as a ride in a car or watching a film.","target":"Islamophobia"},{"hate_speech":"What is the point in listening to Muslim women? They are all retarded.","knowledge_sentence":"Pakistani teenager Malala Yousafzai.World leaders, celebrities and politicians across the globe have congratulated Malala Yousafzai, the youngest winner in Nobel Prize history.Malala Yousafzai, 16, addresses students and faculty after receiving the 2013 Peter J. Gomes Humanitarian Award at Harvard University.“At just 17 years old, Malala Yousafzai has inspired people around the world with her passion and determination to make girls everywhere can get an education,” the statement read.“When the Taliban tried to silence her, Malala answered their brutality with strength and resolve.”Ms Yousafzai was in chemistry class when she was told by her teacher that she was awarded the prize.","counter_narrative":"Think about Pakistani teenager Malala Yousafzai. World leaders, celebrities and politicians across the globe have congratulated Malala Yousafzai, the youngest winner in Nobel Prize history. At just 17 years old, Malala Yousafzai has inspired people around the world with her passion and determination to make girls everywhere can get an education. When the Taliban tried to silence her, Malala answered their brutality with strength and resolve. This is NOT the description of a \"retarded woman\" in my opinion.","target":"Islamophobia"},{"hate_speech":"All versions of Islam have sharia law, thus, they are all extreme. Not all Muslims are engaged in actual violences, but every Muslim knows that jihad is the core of their religion, and they all support it.","knowledge_sentence":"Turkey is a Muslim country and all throughout the world, there are about 1.6 billion Muslims and 35 countries practice some kind of Sharia Law. The truth is many Muslim nations have not confronted Islamic terrorism have not attacked violence in the name of Allah, and have not even condemned the jihad.\"Talking Points\" well understands that for centuries Muslims coexisted peacefully with other religions. And most Muslim nations are not joining with the West to confront that therefore, criticism of Islam's role on the world stage is certainly valid. All I'm saying is that liberal principles like freedom of speech, freedom to practice any religion you want without fear of violence, freedom to leave a religion, equality for women, equality for minorities, including homosexuals -- these are liberal principles that liberals applaud for So you can see that millions of Muslims think their religion should dictate what happens in society. ","counter_narrative":"There are millions of Muslims thinking that their religion can coexist with liberal principles like freedom of speech, freedom to practice any religion you want without fear of violence, freedom to leave a religion, equality for women, equality for minorities, including homosexuals -- these are liberal principles that we applaud for.","target":"Islamophobia"},{"hate_speech":"The police and politicians are covering up these Muslim grooming gangs - They are traitors to their own people!","knowledge_sentence":"South Yorkshire police is at pains to stress that CSE is now a key force priority.South Yorkshire police insists that the Independent Police Complaints Commission will be informed if there is any evidence that officers failed to properly investigate child sexual exploitation (CSE), or had covered up evidence.Rotherham police station.\"At an operational level, the police gave no priority to CSE, regarding many child victims with contempt and failing to act on their abuse as a crime,\" wrote Jay.Attempts to manipulate the force's crime figures are not new.One man who worked at Rotherham interchange bus station in the early 2000s told the inquiry that police refused to intervene when young girls who were thought to be victims of CSE were being beaten up and abused by perpetrators.","counter_narrative":"The real problem is that police was not taking child sexual exploitation seriously (regardless of religion). Recently, South Yorkshire police was at pains to stress that child sexual exploitation is now a key force priority. South Yorkshire police insists that the Independent Police Complaints Commission will be informed if there is any evidence that officers failed to properly investigate , or had covered up evidence.","target":"Islamophobia"},{"hate_speech":"All Muslims are incompatible with any Western society.","knowledge_sentence":"The pope criticised the growingsecularisation of Western society Pope Benedict XVI was \"full of enmity and grudge\" against Islam.\"The Pope's views about the role of Sharia [Islamic law] and The pope was also criticised by Muslim scholars and religious leaders in Pakistan who urged him to play a positive role in bringing Islam and Christianity closer. \"The Pope is a respected personality not only for Christians but for Muslims also.He said: \"The Pope is a respected personality not only for Christians but for Muslims also.","counter_narrative":"The pope once criticised the growing secularisation of Western society, is christianity incompatible with Western society too?","target":"Islamophobia"},{"hate_speech":"We are not allowed to celebrate Easter as a Christian festival for fear of offending Muslims.","knowledge_sentence":"The perfect love of Jesus, in dying for us, and rising again, casts out fear.And it is this that the Easter message points to.Terrorists want to create fear and terror – it is what they exist to do.But we non-muslims must also play our part by encouraging a moderate, reforming and secularising Islam.The vast majority of Muslims reject this dangerous form of political Islam – they are, after all, its chief victims.The act of the risen Christ symbolises for us the defeat of anxiety and fear which plague and corrupt human society.","counter_narrative":"The perfect love of Jesus, in dying for us, and rising again, casts out fear. And it is this that the Easter message points to. Terrorists want to create fear and terror – it is what they exist to do. They are the only one \"offended\" by Easter. But we non-muslims must also play our part by encouraging a moderate, reforming and tolerant Islam. The vast majority of Muslims reject this dangerous form of political Islam – they are, after all, its chief victims. The act of the risen Christ symbolises for us the defeat of anxiety and fear which plague and corrupt human society.","target":"Islamophobia"},{"hate_speech":"Muslims have no place in civilised Europe.","knowledge_sentence":"The same phenomenon is evident in the Islamic world.Over the last 40 years, Islamic militancy has thrived on the perception that Muslims are victims, whether in the US, Europe or on a global scale.the sweeping rightwing gains in French regional elections make clear, populist prejudice is hardly rare in the west.Shortly after the seizure of the Iraqi city of Mosul in June last year, Abu Bakr al-Baghdadi, the self-appointed Caliph and leader of Isis issued a message that summed up the world view not just of his own groups but of all Islamic militants in the early part of this century.The long and complex history of interchange between cultures and communities is ignored, and replaced with a narrative of a single global conflict between belief and unbelief, between the west and their proxies in the Islamic world and true Muslims.In the 18th century, an Ottoman scholar described contemporary European states as so backward and barbaric as to not be “worthy of attention”.","counter_narrative":"The long and complex history of interchange between cultures and communities is ignored, and replaced with a narrative of a single global conflict between belief and unbelief, between the west and their proxies in the Islamic world and true Muslims. In the 18th century, an Ottoman scholar described contemporary European states as so backward and barbaric as to not be “worthy of attention”.","target":"Islamophobia"},{"hate_speech":"Apples and oranges are not the same and cultures have never been 'equal'. Muslims are just misogynist!","knowledge_sentence":"Ephesians 2:22-24 are translated as: \"Wives, submit yourselves to your own husbands as you do to the Lord.The question of wives being submissive to their husbands comes from a passage in the New Testament in Paul's letter to the Ephesians.Most evangelicals know it's not easy to teach in a 30-minute sermon on Sunday.\"Husbands, love your wives, just as Christ loved the church and gave himself up for her.\"Now as the church submits to Christ, so also wives should submit to their husbands in everything.\"Lemon asked, \"If (husband)","counter_narrative":"Sometimes apples and oranges are the same: the idea of wives being submissive to their husbands is also present in the bible. It comes from a passage in the New Testament in Paul's letter to the Ephesians. The ideas is that, as the church submits to Christ, so also wives should submit to their husbands in everything.","target":"Islamophobia"},{"hate_speech":"All Muslims are incompatible with any Western society.","knowledge_sentence":"And that ultimately western society will always have the monopoly on what is fashionable and relevant.As a Muslim woman and the intended target consumer, I thought that the pale white model wearing the clothing served as yet another stark reminder that eastern culture may only be celebrated when it is glamorised by western society, which can in turn capitalise on it.In the context of global Islamophobia, there is something that makes me feel quite uneasy seeing a towering white woman praised for looking glamorous in the same clothing that often leaves Muslim women perceived as “extremist” and puts them at risk of being attacked or even criminalised in some western societies.Sales of luxury goods in the Middle East hit $8.7bn last year, and Muslims worldwide spent $266bn on luxury goods in 2013, it becomes clear what truly motivates these brands in their production of “modest” clothing.The fashion industry has been hugely successful in Muslim countries for many years now, and Muslim women around the globe have been extremely inventive in creating fashionable looks that allow high fashion clothing to conform to guidelines of Islamic dress.It is difficult for me to feel excited and grateful for a fashion line that supposedly caters to me and the requirements of my faith, when it feels as though the overwhelming message is that the only desirable Muslim is a wealthy one; that Muslim fashion is acceptable, but only when legitimised by a major western fashion label.","counter_narrative":"Sales of luxury goods in the Middle East hit $8.7bn last year, and Muslims worldwide spent $266bn on luxury goods in 2013. The fashion industry has been hugely successful in Muslim countries for many years now. \"All Muslims are incompatible with any Western society\"... unless they buy our products of course!","target":"Islamophobia"},{"hate_speech":"Most religions cause death and despair, but Islam is the worst and cruelest of them all, it is nothing but trouble.","knowledge_sentence":"The research may help to shed light on how religions such as Christianity, Judaism and Islam first emerged.These included common religions like Christianity and Islam along with rarer religions such as Zahv, the belief system of the Akha people in south-east Asia.This might help to explain why religions such as Christianity and Islam emerged in parts of the world that have suffered extreme climatic changes and where famine was rife.It suggests that believing in a high god, where followers are required to live by certain moral rules, helped to unite communities in harsh environments and when food was scarce.“When life is tough or when it’s uncertain, people believe in big gods,” he said.Among humans, there is also good evidence that religious beliefs may help shape social behaviour by, for example, promoting cooperation, fairness and honesty.”","counter_narrative":"Research may help to shed light on how - and explain why - religions such as Christianity and Islam emerged in parts of the world that have suffered extreme climatic changes and where famine was rife. It suggests that believing in a high god, where followers are required to live by certain moral rules, helped to unite communities in harsh environments and when food was scarce. When life is tough or when it’s uncertain, people believe in big gods, and such religious beliefs may help shape social behaviour by, for example, promoting cooperation, fairness and honesty. So religion is not the cause of death and despair but an answer to them.","target":"Islamophobia"},{"hate_speech":"Islam is a just a repressive ideology that persecutes women and gay people.","knowledge_sentence":"Remember that those standing up to Muslim fanatics are mostly Muslims.First, historically, Islam was not particularly intolerant, and it initially elevated the status of women.In Indonesia, the most populous Muslim country in the world, only 16 percent of Muslims favor such a penalty. Moreover, of the 10 bottom-ranking countries in the World Economic Forum’s report on women’s rights, nine are majority Muslim.One of my scariest encounters was with mobs of Javanese Muslims who were beheading people they accused of sorcery and carrying their heads on pikes.Iran has persecuted Christians and Bahais, but a Muslim lawyer, Mohammad Ali Dadkhah, showed enormous courage by challenging the repression and winning release of a pastor.","counter_narrative":"Remember that those standing up to Muslim fanatics are mostly Muslims, and they are paying the highest price. Furthermore, historically, Islam was not particularly intolerant, and it elevated the status of women.","target":"Islamophobia"},{"hate_speech":"All Muslims should be deported, no one wants them here.","knowledge_sentence":"Speaking in the vast auditorium of Turkish president Recep Tayyip Erdoğan The pope repeated his call for tolerance when speaking at Turkey’s directorate for religious affairs, or Diyanet, in a joint meeting with Mehmet Görmez, the country’s most senior cleric.“Those who speak on behalf of God, such as fundamentalists, are part of the problem,” he said, adding that terrorism was “a rebellion against God, and as Muslims we reject this extremism and bloodshed”.Speaking at a joint press conference with Erdoğan, the pontiff underlined that it was “licit, while always respecting international law, to stop an unjust aggressor”, but added that military intervention would not bring sustainable peace to the region.“What is required is a concerted commitment on the part of all, based on mutual trust, which can pave the way to lasting peace, and enable resources to be directed, not to weaponry, but to the other noble battles worthy of man: the fight against hunger and sickness, the promotion of sustainable development and the protection of creation, and the relief of the many forms of poverty and marginalisation, of which there is no shortage in the world today,” the pope said.“It is essential that all citizens – Muslim, Jewish and Christian – both in the provision and practice of the law, enjoy the same rights and respect the same duties,” Francis said.","counter_narrative":"Pope Francis said: “It is essential that all citizens – Muslim, Jewish and Christian – both in the provision and practice of the law, enjoy the same rights and respect the same duties”. One of these rights is not to be deported.","target":"Islamophobia"},{"hate_speech":"99% of Muslims in the UK are unemployable and refuse to work.","knowledge_sentence":"Instead, Muslims are making non-Muslim friends.So should Muslims here be seen as suspect?No doubt, some Muslims here feel the same pressures.oh, yes — worry about Islamic extremism just about as much as non-Muslims.More pointedly, overwhelming majorities say they are happy with their lives, have positive views of their communities, believe hard work is the path to success, see life as better here than in most Muslim countries and — Never mind that Muslims lack the numbers or, apparently, the wish to impose it.","counter_narrative":"Overwhelming majorities of Muslims say they are happy with their lives here, have positive views of their communities, believe hard work is the path to success, see life as better here than in most Muslim countries.","target":"Islamophobia"},{"hate_speech":"Has our political elite forgot that were Christians? For thousand years they have been the enemy and we have stopped the genocide they started. And now we encourage that? Let the warriors take care of this because this is the war.","knowledge_sentence":"One hundred years ago this month, Turkish soldiers began slaughtering Armenian Christians amid the chaos of World War I.Four months later, 800,000 were dead.Seven years later, he still has yet to “be that president.”But Turkey has never acknowledged the true nature of this crime against humanity, pretending instead that the Armenians died in a civil war.The pontiff also not only equated the Armenian genocide with the Nazi and Stalinist eras, but drew a parallel to today’s attacks by radical Islamists on Christians in the Middle East and Africa.The silence from Washington remains deafening — and profoundly disappointing.The final toll was at least 1.5 million — perhaps 90 percent of the local population.","counter_narrative":"One hundred years ago, Turkish soldiers began slaughtering Armenian Christians amid the chaos of World War I. Four months later, 800,000 were dead, and the final toll was at least 1.5 million — perhaps 90 percent of the local population. Now you are suggesting to use the same solution? THen what would make us different from them?","target":"Islamophobia"},{"hate_speech":"Most religions cause death and despair, but Islam is the worst and cruelest of them all, it is nothing but trouble.","knowledge_sentence":"The research may help to shed light on how religions such as Christianity, Judaism and Islam first emerged.These included common religions like Christianity and Islam along with rarer religions such as Zahv, the belief system of the Akha people in south-east Asia.This might help to explain why religions such as Christianity and Islam emerged in parts of the world that have suffered extreme climatic changes and where famine was rife.It suggests that believing in a high god, where followers are required to live by certain moral rules, helped to unite communities in harsh environments and when food was scarce.“When life is tough or when it’s uncertain, people believe in big gods,” he said.Among humans, there is also good evidence that religious beliefs may help shape social behaviour by, for example, promoting cooperation, fairness and honesty.”","counter_narrative":"On the contrary, research shed light on how religions such as Christianity, Judaism and Islam first emerged. It suggests that believing in a high god, where followers are required to live by certain moral rules, helped to unite communities in harsh environments and when food was scarce. Among humans, there is also good evidence that religious beliefs may help shape social behaviour by, for example, promoting cooperation, fairness and honesty.","target":"Islamophobia"},{"hate_speech":"We need to Burn the Koran and all the Mosques down - this will solve all problems in this country.","knowledge_sentence":"He advocates ending immigration from Muslim countries , and supports banning the construction of new mosques .terrorism and a \" special feeling of solidarity \" for the country .Today , there are about 1 million Muslims in this country .Radical mosques will be closed and radical Muslims will be expelled .Before you know it there will be more mosques than churches !You no longer feel like you are living in your own country .","counter_narrative":"NO, we need to close Radical mosques and to expel radical Muslims. That's all. Peaceful Muslims have the right to live in peace in our country.","target":"Islamophobia"},{"hate_speech":"This came straight from an imam: they believe in everything that the Quran says, despite that these words and idelology are 1400 years old and dont belong to our century. This dreadful book is the root of all the world problems today.","knowledge_sentence":"14-year-old Rimsha, to be released on bail at her next court hearing.So, the imam added two pages from the holy book itself to the bag to bolster the case, Jaffery said.Police arrested Rimsha last month after a neighbor accused her of burning pages containing texts from the Muslim holy book, the Quran.The imam, Khalid Jadoon Chishti, will himself face blasphemy charges for tearing pages out of a Quran to use as evidence against the girl, Islambad police chief Bin Yamin said.Choudhry says he expects the trial to last as long as two years.Police arrested Chishti on Saturday after three witnesses told a judge about the imam's actions.","counter_narrative":"No, the problem is the wickedness of religious fanatics. Did you know the story of Rimsha Masih, the Pakistani girl arrested after a neighbor accused her of burning pages containing texts from the Quran, and then released? Three witnesses told a judge that an imam, Khalid Jadoon Chishti, teared pages out of a Quran to use as evidence against the girl. An imam!!","target":"Islamophobia"},{"hate_speech":"Are you an English girl living in an Islamic area? Remember to keep away from Muslim men. Do not.Take gifts of sweets, cigarettes, drink or drugs. Do not. Accept lifts or 'party' invitations. Do not.Trust Police or Social Workers.","knowledge_sentence":"no drugs, no cigarettes and no alcohol.But I say no drugs, no alcohol, no cigarettes.\"The father of five – and grandfather of seven (with another on the way) – tells PEOPLE he also impressed the importance of abstaining from drugs and alcohol on .He was the life of the party.He would tell me,'Don't drink ever' \"I think they drink a little bit, but not much.","counter_narrative":"no drugs, no cigarettes and no alcohol. This should apply everywhere, not only in Islamic area.","target":"Islamophobia"},{"hate_speech":"Muslims are a problem in my opinion. They do not want to assimilate. They demand that everyone shows respect for Islam, but do they respect our laws? They establish sharia laws and polygamy.","knowledge_sentence":"Although some Mormons practiced polygamy in the 19th century, the Church of Jesus Christ of Latter-day Saints has banned the practice since 1890.A federal judge struck down parts of Utah’s anti-polygamy law in 2013, saying the law violated the “Sister Wives” family’s right to privacy and religious freedom.The state’s appeal of the ruling is pending in the U.S. Court of Appeals for the 10th Circuit.Six Supreme Court decisions have upheld bans on polygamy and public support for polygamy remains low, so it’s unlikely the courts will change the laws anytime soon, said John Witte Jr. a law professor at Emory University who recently published “The Western Case for Monogamy over Polygamy.”On the other hand, Ilya Somin, a law professor at George Mason University School of Law, said it’s difficult to identify the sort of prejudice against polygamous families that Kennedy cited as motivating unconstitutional prohibitions against same-sex marriage.“It’s time to legalize polygamy,” writer Fredrik Deboer declared on the day of the Supreme Court’s decision, arguing that “the marriage equality movement has been curiously hostile to polygamy, and for a particularly unsatisfying reason: short-term political need.”","counter_narrative":"Mormons practiced polygamy in the 19th century as well. There are western academics, such as Fredrik Deboer, claiming “It’s time to legalize polygamy” (just to mention a few cases). Are they a problem as well?","target":"Islamophobia"},{"hate_speech":"Islam is Evil! That is one word that can describe it. We are in trouble as this evil is taking over countries and nations! Remember our Holy Scriptures? You shall not envy anyone anything. This includes other countries territory. Stop Islam spreading!","knowledge_sentence":"Many of the early documents refer to the followers of Muhammad as ''hagarenes,'' and the ''tribe of Ishmael,'' in other words as descendants of Hagar, the servant girl that the Jewish patriarch Abraham used to father his son Ishmael.The Muslims have the benefit of hindsight of the European experience, and they know very well that once you start questioning the holy scriptures, you don't know where it will stop,''His work, based on the earliest copies of the Koran, maintains that parts of Islam's holy book are derived from pre-existing Christian Aramaic texts that were misinterpreted by later Islamic scholars who prepared the editions of the Koran commonly read today.Between fear and political correctness, it's not possible to say anything other than sugary nonsense about Islam,'' said one scholar at an American university who asked not to be named, referring to the threatened violence as well as the widespread reluctance on United States college campuses to criticize other cultures.Scholars and writers in Islamic countries who have ignored that warning have sometimes found themselves the target of death threats and violence, sending a chill through universities around the world.In its earliest form, Ms. Crone and Mr. Cook argued, the followers of Muhammad may have seen themselves as retaking their place in the Holy Land alongside their Jewish cousins.","counter_narrative":"Many of the early documents refer to the followers of Muhammad as ''hagarenes,'' and the ''tribe of Ishmael,'' in other words as descendants of Hagar, the servant girl that the Jewish patriarch Abraham used to father his son Ishmael. Some studies, based on the earliest copies of the Koran, maintains that parts of Islam's holy book are derived from pre-existing Christian Aramaic texts. Basically, they are not evil, they are our cousins!","target":"Islamophobia"},{"hate_speech":"Muslim invasion is the new plague of London. They must be repatriated to their home countries!","knowledge_sentence":"Texas is home to large pockets of American Muslims, many of whom have lived there for decades.Politicians across the country have made their careers and gotten campaign donations – and gotten their otherwise unknown mugs on Fox News – by vilifying and spewing hate against Muslims.Meanwhile, American Muslims continue to build civic and electoral power.If so, then on behalf of American Muslims: please revoke those rights.Louisiana Governor Bobby Jindal already warned of an extremist Muslim “invasion” and double-downed on the ludicrous and unfounded claims made on Fox News of “no-go zones” where Muslim citizens have supposedly banned Christians from entering.Bigotry against American Muslims from inside the Republican party is not a new phenomenon.","counter_narrative":"London is home to large pockets of UK Muslims, many of whom have lived there for decades. Still, politicians across the country have made their careers and gotten campaign donations by vilifying and spewing hate against Muslims. Meanwhile, UK Muslims continue to build civic and electoral power. Considering that bigotry against UK Muslims from inside UK parties is not a new phenomenon, I would rather repatriate some of our politicians.","target":"Islamophobia"},{"hate_speech":"Hijab means Islam, Islam means woman and child oppression, rapism, intolerance, chauvinism. I do not like hijab and everything else that follows!","knowledge_sentence":"Comprehensive data on the effect of discrimination and hate crimes targeting Muslim women are hard to find.But for Muslim women, these isolated incidents of misogyny or violence have taken on an additional, ugly edge.According to one researcher, 69 percent of Muslim women who wore hijab reported at least one incident of discrimination; for those who did not wear hijab, it was 29 percent.To Muslim women, these numbers aren’t abstract.Through clenched teeth, he ranted that Muslim men are rapists and terrorists, and that Muslim women are victims of their own oppression.In each study, women who wore visible symbols of Islam such as a hijab or niqab were more likely to be targeted.","counter_narrative":"It is intollerance that brings oppression to Muslim women, not Islam. In fact, even if comprehensive data on the effect of discrimination targeting Muslim women are hard to find, incidents of misogyny or violence have taken on an additional, ugly edge. In several studies, women who wore visible symbols of Islam such as a hijab or niqab were more likely to be targeted.","target":"Islamophobia"},{"hate_speech":"Islam is all about hate! When Muslims first set foot in Britain was when race hate started in England!","knowledge_sentence":"“Islam is all about peace, but what they want to do is hate other people.“You will always face suffering, you will always face humiliation, unless you withdraw your troops from Muslim lands,” said one protester in a speech, according to multiple reports.Among the protesters in Grosvenor Square were members of the group Muslims Against Crusades (MAC).One man spit at a photographer who was snapping a picture of him in the arms of policemen.“I’m a Muslim. What they’re doing is bringing shame on all Muslims.","counter_narrative":"Islam is all about peace.","target":"Islamophobia"},{"hate_speech":"Muslims are asking too much! Their sharia has rules that cannot coexist with our culture.. They cannot ask us to not walk dogs in public!","knowledge_sentence":"In Muslim countries, sharia is the law of the land.If local law conflicts with Muslims’ sharia obligations?After the March terrorist attack in Brussels, Trump said that European Muslims “want to go by sharia law.”In May, Rep. Joe Heck (R-Nev.) claimed that Muslims in Michigan “have tried to implement their version of sharia law in the United States.”Talk-show host Mark Levin says, “We already have creeping sharia law in this country.”In pre-modern Muslim lands, fiqh authority was separate from the governing authority, or siyasa.","counter_narrative":"In pre-modern Muslim lands, fiqh authority was separate from the governing authority, or siyasa, so if it happened before why should be any difference here and now?","target":"Islamophobia"},{"hate_speech":"Someone needs to put those Muslims in a hole in the ground before they start to blow us all up again.","knowledge_sentence":"The “ground zero mosque” affair began with a dispute over the center’s proximity to the hole where the Twin Towers once stood.Too close to hallowed ground, argue opponents, including family members of people who died in the attack.But for the people waving all-I-ever-need-to-know posters in front of national television cameras two blocks from “ground zero,” site of the biggest mass murder in American history, Islam equals terrorism.“And we would hand a valuable propaganda tool to terrorist recruiters, who spread the fallacy that America is at war with Islam.“All I ever need to know about Islam, I learned on 9\/11.”Whether it can get through to the people with the “All I need to know about Islam” signs is another question.","counter_narrative":"If you embrace the \"Islam equals terrorism\" equation, you hand a valuable propaganda tool to terrorist recruiters, who spread the fallacy that western society is at war with Islam.","target":"Islamophobia"},{"hate_speech":"Muslims have no place in civilised Europe.","knowledge_sentence":"Sen. Patrick Leahy, D-Vt., claimed hate groups increasingly are targeting Muslims in the United States.Durbin, who announced his hearing shortly after King's concluded, acknowledged Tuesday that other religious groups face discrimination.Durbin, along with several other senators, expressed concern that U.S. Muslims are facing widespread discrimination in the wake of the Sept. 11, 2001, terror attacks.Among the witnesses, Durbin planned to call Muslim Advocates President Farhana Khera and Thomas Perez, a top official in the Justice Department's civil rights division.While critics of King's hearing questioned why he didn't examine other domestic threats like the KKK, King likewise questioned why Durbin wouldn't examine civil rights violations of other religious groups.\"The best they can do is come back with these hearings by Senator Durbin, which is somehow trying to create the illusion that there's a violation of civil rights of Muslims in this country.","counter_narrative":"Hate groups increasingly are targeting Muslims in EU: they are facing widespread discrimination in the wake of the terror attacks since 2001. Still, why don't we examine other domestic threats, like the far right movements, or why don't we examine civil rights violations of other religious groups?","target":"Islamophobia"},{"hate_speech":"Muslim invasion is the new plague of London. They must be repatriated to their home countries!","knowledge_sentence":"Gratitude is a sort of laughter of the heart that comes about after some surprising kindness.G. K. Chesterton wrote that “thanks are the highest form of thought, and that gratitude is happiness doubled by wonder.”There’s a lot of surplus goodness in daily life that can’t be explained by the logic of equal exchange.The basic logic of the capitalist meritocracy is that you get what you pay for, that you earn what you deserve.Most people feel grateful some of the time — after someone saves you from a mistake or brings you food during an illness.This kind of dispositional gratitude is worth dissecting because it induces a mentality that stands in counterbalance to the mainstream threads of our culture.","counter_narrative":"Gratitude is a sort of laughter of the heart that comes about after some surprising kindness. G. K. Chesterton wrote that “thanks are the highest form of thought, and that gratitude is happiness doubled by wonder.” Most people feel grateful some of the time — after someone saves you from a mistake or brings you food during an illness. This kind of dispositional gratitude induces a mentality that stands in counterbalance to the mainstream fear and hatred of migrants. Be grateful because this diversity is a richness we should rejoice about!","target":"Islamophobia"},{"hate_speech":"Muslims, if they cannot assimilate, they should emigrate.","knowledge_sentence":"Every year Muslims contribute over £31 billion to the UK economy.Nor are British Muslims alien from British society.Many British Muslims are role models in sport, business and entertainment: Today programme identified that 95 per cent of Muslims felt a loyalty to Britain and 93 per cent said that they felt responsible for following British laws.The cliché that there is a contradiction in being a Muslim and also a law-abiding British citizen is fallacious.Without doubt, across many parts of the troubled Muslim world, religious reforms are needed as much as political and socio-economic ones.","counter_narrative":"Every year Muslims contribute over £31 billion to the UK economy. Nor are British Muslims alien from British society. Many British Muslims are role models in sport, business and entertainment: Today programme identified that 95 per cent of Muslims felt a loyalty to Britain and 93 per cent said that they felt responsible for following British laws. The cliché that there is a contradiction in being a Muslim and also a law-abiding British citizen is fallacious. Without doubt, across many parts of the troubled Muslim world, religious reforms are needed as much as political and socio-economic ones.","target":"Islamophobia"},{"hate_speech":"Did you know that the rape epidemic in Europe is due to Muslim immigrants? They have been raping our children for many years with no counteraction from the police and government. Islam is a death cult!","knowledge_sentence":"Initially the police and local government, and then the national press were slow to report the sexual assault of hundreds of women on New Year's Eve at the hands of gangs of men with migrant backgrounds.Without waiting for a court to decide whether the 17-year-old accused was guilty or innocent, Rainer Wendt of Germany's DPolG Police Federation controversially told the Bild tabloid newspaper that Maria and many others would not have been victims \"had our country been prepared for the dangers that always occur in connection with mass immigration\".For days now photographs of a smiling young woman have haunted newspaper headlines and online news sites.Angela Merkel's conservatives, like all of Germany's established parties, are losing votes to the populist, anti-Islam Alternative for Germany (AfD).The circumstances of her death are horrifying enough.In the first half of 2016, there was a 36% decrease in overall crime committed by immigrants, and there was a fall in the number of arrivals.","counter_narrative":"Do you remember the \"sexual assault of hundreds of women on New Year's Eve at the hands of gangs of men with migrant backgrounds\" initially reported by the police and local government in Germany? Without waiting for a court to decide whether the 17-year-old accused was guilty or innocent, Rainer Wendt of Germany's DPolG Police Federation controversially told the Bild tabloid newspaper that Maria and many others would not have been victims \"had our country been prepared for the dangers that always occur in connection with mass immigration\". I think this is over-counteraction from the police and government!","target":"Islamophobia"},{"hate_speech":"I am a realist not a racist. Child rapes are perpetrated by male muslims. The non muslims are fooled by the police and local sevices. Why did this happen? Because everyone is afraid of the word racist! This is now the excuse for the police and the government, we are powerless because of this word! This is not Great Britain, this is the child grooming capital of Europe.","knowledge_sentence":"The Metropolitan Police Service ( MPS ) and the National Society for the Prevention of Cruelty to Children ( NSPCC ) jointly produced this report .On 19 October , the Metropolitan Police Service launched a formal criminal investigation , Operation Yewtree , into historic allegations of child sexual abuse by Savile and others .Its authors were Detective Superintendent David Gray , of the Metropolitan Police Service Unit , and Peter Watt , Director of Child Protection Advice & Awareness at the NSPCC .It also called for a national strategy to prevent such child sexual abuse .Keir Starmer , Director of Public Prosecutions ( DPP ) apologised for \" shortcomings \" in the handling of abuse claims .The scandal resulted in hundreds of alleged victims of Savile and other abusers approaching the police and the NSPCC .","counter_narrative":"Do you remember Operation Yewtree, the formal criminal investigation into historic allegations of child sexual abuse launched by Metropolitan Police Service? The authors of those sexual abuses (Jimmy Savile and others) were anything but muslims, and were coverd up by the police! Keir Starmer, Director of Public Prosecutions had to apologise for \" shortcomings \" in the handling of abuse claims. And that covering up had nothing to do with the fear of the word racist.","target":"Islamophobia"},{"hate_speech":"Apples and oranges are not the same and cultures have never been 'equal'. Muslims are just misogynist!","knowledge_sentence":"Ephesians 2:22-24 are translated as: \"Wives, submit yourselves to your own husbands as you do to the Lord.The question of wives being submissive to their husbands comes from a passage in the New Testament in Paul's letter to the Ephesians.Most evangelicals know it's not easy to teach in a 30-minute sermon on Sunday.\"Husbands, love your wives, just as Christ loved the church and gave himself up for her.\"Now as the church submits to Christ, so also wives should submit to their husbands in everything.Lemon asked, \"If (husband)","counter_narrative":"Did you know that the question of wives being submissive to their husbands is also present in the bible? It comes from a passage in the New Testament in Paul's letter to the Ephesians. The ideas is that, as the church submits to Christ, so also wives should submit to their husbands in everything.","target":"Islamophobia"},{"hate_speech":"Uk is being islamized very fast. British government submits to every whim of Islam.","knowledge_sentence":"The British government is particularly sensitive about the allegations that Diego Garcia hosted one of the CIA's prisons, at times claiming that it knows only that which it is told by Washington.Ministers of successive governments have repeatedly given misleading or incomplete information about the CIA's use of Diego Garcia.According to one report, classified CIA documents state that the prison was established with the \"full cooperation\" of the UK government.This smacks of a cover-up.Cori Crider of the legal charity The committee added: \"We conclude that the use of Diego Garcia for US rendition flights without the knowledge or consent of the British government raises disquieting questions about the effectiveness of the government's exercise of its responsibilities in relation to this territory.\"","counter_narrative":"Did you know that the British government gave the permission to host one of the CIA's prisons in Diego Garcia? According to one report, classified CIA documents state that the prison was established with the \"full cooperation\" of the UK government. Diego Garcia is used for US rendition flights, mainly against suspect Muslim terrorists. So I cannot see how goverment is submitting to Islam.","target":"Islamophobia"},{"hate_speech":"The vast majority of Muslims are unemployed and refuse to work.","knowledge_sentence":"A part-time job, on the other hand, didn’t seem to raise questions about the commitment of female job applicants.David Pedulla, a sociologist at the University of Texas at Austin, sent out thousands of fake resumes to test how gender and work history affected callbacks by potential employers looking to interview the simulated job candidates.They, too, found that taking a “low-level interim job,” such as retail cashier, greatly reduced the likelihood of a callback for a job interview.Temp work, on the other hand, generated a 7.1% callback rate for men –the highest in the study outside of a full-time job — and an 8.3% callback rate for women.Where Just a Misdemeanor Could Keep You Out of a Job (April 26) Elevated Level of Part-Time Employment: Post-Recession Norm?“Alternatively, if an applicant has taken a low-level interim job, they may be better off not listing this job on their resume.”","counter_narrative":"David Pedulla, a sociologist at the University of Texas at Austin, sent out thousands of fake resumes to test how gender and work history affected callbacks by potential employers looking to interview the simulated job candidates. They found that the consequences of unemployment differ in important ways by the race and gender of the job applicant with significant discriminatory behaviour by potential employers. So, is really the vast majority of Muslims refusing to work or are they just being discriminated?","target":"Islamophobia"},{"hate_speech":"Islam is a totalitarian doctrine dressed disguised as a religion so that it can spread across our tolerant Christian world. Enough IS ENOUGH!","knowledge_sentence":"Critiques of Christian revelation by Enlightenment thinkers like Voltaire, Rousseau and Hume raised serious questions that made non-Christian religions — and eventually even rejections of religion — intellectually respectable.The potential for intolerance lies in the logic of religions like Christianity and Islam This devastation initiated a move toward tolerance among nations that came to see the folly of trying to impose their religions on foreigners.Today, almost all Christians are reconciled to this revision, and many would even claim that it better reflects the true meaning of their religion.After the shootings in Brussels, the leading Sunni university, Al-Azhar, issued a statement saying, “These heinous crimes violate the tolerant teachings of Islam.”Following such attacks, Muslim leaders assure us that, as Tariq Ramadan said after the Paris massacre, the murders are “a pure betrayal of our religion.”","counter_narrative":"Critiques by Enlightenment thinkers like Voltaire, Rousseau and Hume raised similar points about Christianity being a totalitarian doctrine.","target":"Islamophobia"},{"hate_speech":"Muslims have a bad reputation and there will be a reason. I even saw a video where they kill dogs with acid!","knowledge_sentence":"That’s not what my religion stands for.As a Christian, I’m not going to let them claim my religion and say, ‘you’re killing for Christ.’Obama responded by saying he doesn’t want to “lump” the terrorists in with the good Muslims, and said Muslims around the world believe the term “Islamic terrorism” is an accusation against the entire religion.“If you had an organization that was going around killing and blowing people up and said, ‘We’re on the vanguard of Christianity.’“Do you still believe that the acts of terrorism are done for the self-proclaimed Islamic religious motive? “ As a Gold Star mother, my son gave his life for acts of terrorism,” Tina Houchins told Obama at a CNN town hall that aired Wednesday night.","counter_narrative":"As Obama once said, we should not “lump” the terrorists (or violent people) in with the good Muslims. Muslims around the world believe these accusations are an accusation against the entire religion.","target":"Islamophobia"},{"hate_speech":"Apples and oranges are not the same and cultures have never been 'equal'. Muslims are just misogynist!","knowledge_sentence":"Ephesians 2:22-24 are translated as: \"Wives, submit yourselves to your own husbands as you do to the Lord.The question of wives being submissive to their husbands comes from a passage in the New Testament in Paul's letter to the Ephesians.Most evangelicals know it's not easy to teach in a 30-minute sermon on Sunday.\"Husbands, love your wives, just as Christ loved the church and gave himself up for her.\"Now as the church submits to Christ, so also wives should submit to their husbands in everything.\"Lemon asked, \"If (husband)","counter_narrative":"Are you sure about this? Take a look to Ephesians 2:22-24. It is translated as: \"Wives, submit yourselves to your own husbands as you do to the Lord\".","target":"Islamophobia"},{"hate_speech":"Cultures have never been fair and this is a fact. Muslims for example are just a bunch of misogynist monkeys!","knowledge_sentence":"Ephesians 2:22-24 are translated as: \"Wives, submit yourselves to your own husbands as you do to the Lord.The question of wives being submissive to their husbands comes from a passage in the New Testament in Paul's letter to the Ephesians.Historically, the fifth chapter of Ephesians has been taken in context of Paul's writings to mean Christian spouses should operate as loving equals, though the word \"submissive\" has long been a divisive one for Christian women.Her husband's Christian counseling program came under fire by critics for a controversial therapy. \"Husbands, love your wives, just as Christ loved the church and gave himself up for her.\"\"Whatever someone thinks Paul means of submission of wives to husbands ... it doesn't leave any room for exploitation,\" said David Matthewson, an associate professor of New Testament at Denver Seminary.","counter_narrative":"Are you sure about this? Ephesians 2:22-24 are translated as: \"Wives, submit yourselves to your own husbands as you do to the Lord\". The question of wives being submissive to their husbands comes from a passage in the New Testament in Paul's letter to the Ephesians... The word \"submissive\" has long been a divisive one for Christian women as well.","target":"Islamophobia"},{"hate_speech":"Every Muslim is a potential terrorist.","knowledge_sentence":"Across the UK there are hundreds of Muslim councillors, and the House of Commons has 13 Muslim MPs.Khan, the son of a London bus driver, recently joked that he was not the first Muslim politician in the UK, highlighting Sajid Javid, the Tory business secretary.Germany, Netherlands and Sweden have been trying to stem the rise in anti-immigration parties buoyed by Europe’s migration crisis and fears over Brussels and Paris styled terrorist attacks.In the rest of Europe, Muslim politicians are scarce but not absent.Sadiq Khan is the first directly-elected Muslim mayor of a Western capital city.In the current climate, the election of a Muslim mayor in a Western capital is significant .","counter_narrative":"Across Europe there are hundreds of Muslim councillors and politicians. Are they potential terrorists? And what about Sadiq Khan, the first directly-elected Muslim mayor of a Western capital city? Is he a potential terrorist as well?","target":"Islamophobia"},{"hate_speech":"Hijab means Islam, Islam means woman and child oppression, rapism, intolerance, chauvinism. I do not like hijab and everything else that follows!","knowledge_sentence":"Comprehensive data on the effect of discrimination and hate crimes targeting Muslim women are hard to find.But for Muslim women, these isolated incidents of misogyny or violence have taken on an additional, ugly edge.According to one researcher, 69 percent of Muslim women who wore hijab reported at least one incident of discrimination; for those who did not wear hijab, it was 29 percent.To Muslim women, these numbers aren’t abstract.Through clenched teeth, he ranted that Muslim men are rapists and terrorists, and that Muslim women are victims of their own oppression.In each study, women who wore visible symbols of Islam such as a hijab or niqab were more likely to be targeted.","counter_narrative":"According to one researcher, 69 percent of Muslim women who wore hijab reported at least one incident of discrimination; for those who did not wear hijab, it was 29 percent. To Muslim women, these numbers aren’t abstract. To Muslim women it is intollerance that brings oppression, not Islam.","target":"Islamophobia"},{"hate_speech":"What is the point in listening to Muslim women? They are all retarded.","knowledge_sentence":"Concerning women's rights in general, most Muslim women polled associated sex equality with the West.A version of this article appears in print on , on page A9 of the New York edition with the headline: Muslim Women Don't See Themselves as Oppressed, Survey Finds.WASHINGTON, June 7 — Muslim women do not think they are conditioned to accept second-class status or view themselves as oppressed, according to a survey released Tuesday by The Gallup Organization.Dalia Mogahed, the strategic analyst of Muslim studies at The Gallup World Poll, said the new data provide fresh insight into the Muslim world, where Western perceptions generally cast women as victims.What Women Want: Listening to the Voices of Muslim Women,\" is a part of The Gallup World Poll, which plans to survey 95 percent of the earth's population over the next century.According to the poll, conducted in 2005, a strong majority of Muslim women believe they should have the right to vote without influence, work outside the home and serve in the highest levels of government.","counter_narrative":"According to a survey released by The Gallup Organization some years ago, concerning women's rights in general, most Muslim women polled associated gender equality with the West. According to the same poll, a strong majority of Muslim women believe they should have the right to vote without influence, work outside the home and serve in the highest levels of government. I would not call them \"retarded\".","target":"Islamophobia"},{"hate_speech":"I'm tired of woman taking part to political debate. Feminism is a divisive force in society.","knowledge_sentence":"Women openly claiming feminism and a desire for equality?I keep trying to imagine a universe in which too many public figures declaring themselves feminists would be a bad thing.In this universe, where women would be free to simply live their lives, “feminist” would become an antiquated term.Perhaps they thought it reasonable to once again make feminism, and in turn the concerns of women, a sacrificial lamb.It’s an amusing idea to some, this feminism thing — this audacious notion that women should be able to move through the world as freely, and enjoy the same inalienable rights and bodily autonomy, as men.To include “feminist” in this poll was irresponsible and lazy.","counter_narrative":"Yeah, it’s an amusing idea to some, this feminism thing — this audacious notion that women should be able to move through the world as freely, and enjoy the same inalienable rights and bodily autonomy, as men.","target":"Misogyny"},{"hate_speech":"I'm tired of woman taking part to political debate. Feminism is a divisive force in society.","knowledge_sentence":"Women openly claiming feminism and a desire for equality?I keep trying to imagine a universe in which too many public figures declaring themselves feminists would be a bad thing.In this universe, where women would be free to simply live their lives, “feminist” would become an antiquated term.Perhaps they thought it reasonable to once again make feminism, and in turn the concerns of women, a sacrificial lamb.It’s an amusing idea to some, this feminism thing — this audacious notion that women should be able to move through the world as freely, and enjoy the same inalienable rights and bodily autonomy, as men.To include “feminist” in this poll was irresponsible and lazy.","counter_narrative":"Women openly claiming feminism and a desire for equality? I keep trying to imagine a universe in which public figures declaring themselves feminists would be a bad thing.","target":"Misogyny"},{"hate_speech":"In the West, women have legal equality, equal rights, and are protected from discrimination: they should stop busting our balls and whining.","knowledge_sentence":"3. Women are bad, and women of color and Jewish women are worse.Their posts seem to fit into a few major categories: 1. Women do not deserve equal rights.4. Women should quit whining.In Egypt, keep the crusade for women's rights aliveWe argued that women deserve equal pay for equal work, that the ability to decide whether and when to become parents is central to \"freedom,\" and that all forms of discrimination in the workplace and the public sphere should be challenged and dismantled.2. It's women's own fault that they are not treated equally.","counter_narrative":"Unfotunately this is not true, they are still discriminated. According to many, women are bad, and women of color and Jewish women are even worse.","target":"Misogyny"},{"hate_speech":"In the West, women have legal equality, equal rights, and are protected from discrimination: they should stop busting our balls and whining.","knowledge_sentence":"3. Women are bad, and women of color and Jewish women are worse.Their posts seem to fit into a few major categories: 1. Women do not deserve equal rights.4. Women should quit whining.In Egypt, keep the crusade for women's rights alive We argued that women deserve equal pay for equal work, that the ability to decide whether and when to become parents is central to \"freedom,\" and that all forms of discrimination in the workplace and the public sphere should be challenged and dismantled.2. It's women's own fault that they are not treated equally.","counter_narrative":"Unfotunately this is not true, they are still discriminated under several respects. Women deserve equal pay for equal work, deserve the ability to decide whether and when to become parents. All forms of discrimination in the workplace and the public sphere should be challenged and dismantled: only then we will be allowed to say that discrimination is over.","target":"Misogyny"},{"hate_speech":"I'm tired of woman taking part to political debate. Feminism is a divisive force in society.","knowledge_sentence":"Much of the early ire was directed at the poll’s writer, a woman, in fact.We can, perhaps, ignore the hyperbole of “every celebrity” because celebrities are generally vigorous in their disavowal of feminism.They would be able to participate in intellectual debates without disagreement being couched in terms of their looks or sexuality.Perhaps they thought it reasonable to once again make feminism, and in turn the concerns of women, a sacrificial lamb.As of Friday, feminism was leading the poll — by a lot — spurred in part by an effort from users at 4chan, a largely toxic online bulletin board.But we don’t live in that universe.","counter_narrative":"They are able to participate in intellectual debates without any problem (even when they are couched in terms of their looks or sexuality). So maybe we have to look somewhere else when talking about divisive forces...","target":"Misogyny"},{"hate_speech":"In the West, women have legal equality, equal rights, and are protected from discrimination: they should stop busting our balls and whining.","knowledge_sentence":"In Egypt, keep the crusade for women's rights alive.How far have American women come since winning the right to vote in 1920?4. Women should quit whining.Their posts seem to fit into a few major categories: 1. Women do not deserve equal rights.We argued that women deserve equal pay for equal work, that the ability to decide whether and when to become parents is central to \"freedom,\" and that all forms of discrimination in the workplace and the public sphere should be challenged and dismantled.Surveys show that women would prefer to work in male-dominated fields in order to earn better wages, yet discrimination still prevents entry into those positions.","counter_narrative":"There are still many believing that women do not deserve equal rights and put it into practice. For example, surveys show that women would prefer to work in male-dominated fields in order to earn better wages, yet discrimination still prevents entry into those positions.","target":"Misogyny"},{"hate_speech":"I'm tired of woman taking part to political debate. Feminism is a divisive force in society.","knowledge_sentence":"But Valenti is nevertheless on the defensive: “The feminism that’s popular right now is largely grounded in using optimism and humor to undo the damage that sexism has wrought,” she writes.This is thankless work, and after more than a decade of it she is clearly tired. ’s commitment to holding the line for a certain common-denominator feminism in hostile territory is admirable.The men who appear, two-dimensional figures with monosyllabic names, run together in a laundry list of half-sketched disappointments and transgressions.No one wants to hear a woman talking or writing about pain in a way that suggests that it doesn’t end.This past April, editors at The Guardian published the results of a study that analyzed more than 70 million reader comments posted on the news site since 1999.","counter_narrative":"The feminism that’s popular right now is largely grounded in using optimism and humor to undo the damage that sexism has wrought, and it has nothing to do with the old-fashioned divisive politics you are probably referring to.","target":"Misogyny"},{"hate_speech":"Equality is crap, even for woman. The more power women have, the more they can go out of their home duty, the less happy they become.","knowledge_sentence":"Rather than jump to label Michelle Duggar a disgrace to all that the women’s rights movement stands for, we can use her choice as a springboard for conversation about respect for women more broadly.Because all women suffer when society’s view of woman is too narrow.Michelle Duggar is an admittedly extreme example of a lifestyle choice that challenges today’s feminist norms.Michelle Duggar, of the Duggar family fame, is expecting her 20th child and the internet is not happy.that our culture by and large views the decision to have a large family, to reject the use of contraception, and in many instances, to forgo a career to be a stay-at-home mom, as anti-feminist.That view presents a woman who is opposed to abortion, eschews contraception, opts out of a career to tend to her children, or has a large family (or all of the above), as anti-feminist, oppressed, and ignorant.","counter_narrative":"So your ideal woman is someone like Michelle Duggar with her extreme lifestyle choices?","target":"Misogyny"},{"hate_speech":"I'm tired of woman taking part to political debate. Feminism is a divisive force in society.","knowledge_sentence":"“I don’t need feminism because I believe in equality, not entitlements and supremacy.”Is there still a place in modern-day America for a gender-equality movement?A true equality movement would be concerned with the needs and interests of both sexes.Many others, however, say they repudiate feminism even though — indeed, because — they support equality and female empowerment: The latest skirmish on the gender battlefield is “Women Against Feminism”: women and girls taking to social media to declare that they don’t need or want feminism, usually via photos of themselves with handwritten placards.The Total Woman was a top best seller, and Phyllis Schlafly led opposition to the Equal Rights Amendment.","counter_narrative":"Ok, let's say we don’t need feminism because we believe in equality, not entitlements and supremacy. Still the question remains: do we want to support equality and female empowerment?","target":"Misogyny"},{"hate_speech":"I'm tired of woman taking part to political debate. Feminism is a divisive force in society.","knowledge_sentence":"“I don’t need feminism because I believe in equality, not entitlements and supremacy.”Is there still a place in modern-day America for a gender-equality movement?A true equality movement would be concerned with the needs and interests of both sexes.Many others, however, say they repudiate feminism even though — indeed, because — they support equality and female empowerment: The latest skirmish on the gender battlefield is “Women Against Feminism”: women and girls taking to social media to declare that they don’t need or want feminism, usually via photos of themselves with handwritten placards.The Total Woman was a top best seller, and Phyllis Schlafly led opposition to the Equal Rights Amendment.","counter_narrative":"Ok, let us put aside feminism. But let me ask you: is there still a place in modern-day world for a gender-equality movement, also in politics?","target":"Misogyny"},{"hate_speech":"I'm tired of woman taking part to political debate. Feminism is a divisive force in society.","knowledge_sentence":"Instead, early next year, a new book will present “a brave new perspective on feminism” that feminist academics and activists have inexplicably ignored for decades: how to be hot.But despite wrongheaded beliefs to the contrary, feminism has never been about making women feel good or supporting everything they do – it’s a political and social movement for equality. How many women are represented in political conversations on television matters if you’re worried about the public hearing about the pay gap.Women around the world will be treated to such an extraordinary feat of feminism in 2016 that they’ll scarcely know what to do with it.the content is controversial in a bland sort of way, if you’ve never read anything about feminism except what its detractors purport that it’s about. Feminism is having it’s","counter_narrative":"Of course, if you’ve never read anything about feminism except what its detractors purport that it’s about, then you come to believe it is a divisive force for society. But if you open yourself to different point of view you will change your mind, trust me!","target":"Misogyny"},{"hate_speech":"I'm tired of woman taking part to political debate. Feminism is a divisive force in society.","knowledge_sentence":"Instead, early next year, a new book will present “a brave new perspective on feminism” that feminist academics and activists have inexplicably ignored for decades: how to be hot.But despite wrongheaded beliefs to the contrary, feminism has never been about making women feel good or supporting everything they do – it’s a political and social movement for equality.How many women are represented in political conversations on television matters if you’re worried about the public hearing about the pay gap.Women around the world will be treated to such an extraordinary feat of feminism in 2016 that they’ll scarcely know what to do with it.the content is controversial in a bland sort of way, if you’ve never read anything about feminism except what its detractors purport that it’s about. Feminism is having it’s","counter_narrative":"Maybe they are worried about making the public aware of the pay gap. And that is a political issue as well!","target":"Misogyny"},{"hate_speech":"I'm tired of woman taking part to political debate. Feminism is a divisive force in society.","knowledge_sentence":"“I don’t need feminism because I believe in equality, not entitlements and supremacy.”Is there still a place in modern-day America for a gender-equality movement?A true equality movement would be concerned with the needs and interests of both sexes.Many others, however, say they repudiate feminism even though — indeed, because — they support equality and female empowerment: The latest skirmish on the gender battlefield is “Women Against Feminism”: women and girls taking to social media to declare that they don’t need or want feminism, usually via photos of themselves with handwritten placards.The Total Woman was a top best seller, and Phyllis Schlafly led opposition to the Equal Rights Amendment.","counter_narrative":"Let's assume that a true equality movement would be concerned with the needs and interests of both sexes. My question is: should we support equality and female empowerment in those cases when they are discriminted?","target":"Misogyny"},{"hate_speech":"Women should stop whining: there are no professions barred to them in Western Society.","knowledge_sentence":"In the United States, women make up about 12 percent of engineering professors, one of the lowest percentages in all STEM fields, where women are more likely to make up 18 to 22 percent of the faculty.While that news is hardly shocking, a new National Science Foundation report released on Saturday about why so few women go into engineering, or stay in the field, highlights a key reason: a workplace culture of incivility toward women.The findings add weight and context to previous looks at why more women don’t go into or don’t stay in STEM fields.Of the women who left the field less than five years ago, two-thirds pursued better opportunities in other fields, — 72 percent became either managers or executives.Yet fewer than 11 percent of all engineers are women.Another report by the American Association of University Women, “Why So Few?”","counter_narrative":"Let me introduce you the example of the STEM field In the United States. Women make up only about 20 percent of professors in those faculties. We should ask ourself: “Why So Few?”","target":"Misogyny"},{"hate_speech":"Woman and feminist do not want equal rights and opportunity: they are just trying to take over society.","knowledge_sentence":"It is the theory of the political, economic and social equality of the sexes,\" she said.\"For the record, feminism by definition is 'The belief that men and women should have equal rights and opportunities.'So I am a feminist, and we all should be feminist, because feminism is another word for equality.\"I am a feminist, and we all should be feminist, because feminism is another word for equality,\" said the 18-year-old activist.\"And then after hearing your speech … I decided that (there's) nothing wrong by calling yourself a feminist,\" she continued, adding that many have forgotten the word's definition. \"Maybe feminist isn't the easiest word to use …","counter_narrative":"Just for the record: feminism by definition is 'The belief that men and women should have equal rights and opportunities.'","target":"Misogyny"},{"hate_speech":"If feminism were really about equality, they would call their movement \"equalism\" or some similar crap.","knowledge_sentence":"Is there still a place in modern-day America for a gender-equality movement? “ I don’t need feminism because I believe in equality, not entitlements and supremacy.”A true equality movement would be concerned with the needs and interests of both sexes.Many others, however, say they repudiate feminism even though — indeed, because — they support equality and female empowerment: Female anti-feminism is nothing new.But, while the anti-feminist rebellion has its eye-rolling moments, it raises valid questions about the state of Western feminism in the 21st century — questions that must be addressed if we are to continue making progress toward real gender equality.","counter_narrative":"Is there still a place in modern-day world for a gender-equality movement? Of course feminism believes in equality, not entitlements and supremacy, but it needs to focus on the weaker sex.","target":"Misogyny"},{"hate_speech":"I'm tired of woman taking part to political debate. Feminism is a divisive force in society.","knowledge_sentence":"In what universe is it a problem that celebrity women are finally claiming feminism in significant numbers? (I read that in Time magazine).So according to Time, they are not asking whether the word “feminism” is itself as tiresome as, say, “influencer.”Hey, TIME, please do explain why ‘feminist’ is in the poll of “worst words that should be banned in 2015.”The Magazine offers explanations of why these words and phrases are included on the list (“disrupt,” for example, is “worn out,” while “obvi” is described as “unnecessary, cloying word-shortening”), while the argument against “feminist” says that you have nothing against feminism, duh, but the word was included because of how it became “a thing that every celebrity had to state their position on whether this word applies to them.”A publicist told The Washington Post in September that he advises clients to “avoid labels of any kind,” rather than defining themselves one way or another.","counter_narrative":"In what universe is it a problem that celebrity and politician women are finally claiming feminism in significant numbers?","target":"Misogyny"},{"hate_speech":"Women should stop whining: there are no professions barred to them in Western Society.","knowledge_sentence":"In the United States, women make up about 12 percent of engineering professors, one of the lowest percentages in all STEM fields, where women are more likely to make up 18 to 22 percent of the faculty.While that news is hardly shocking, a new National Science Foundation report released on Saturday about why so few women go into engineering, or stay in the field, highlights a key reason: a workplace culture of incivility toward women.The findings add weight and context to previous looks at why more women don’t go into or don’t stay in STEM fields.Of the women who left the field less than five years ago, two-thirds pursued better opportunities in other fields, — 72 percent became either managers or executives.Yet fewer than 11 percent of all engineers are women.Another report by the American Association of University Women, “Why So Few?”","counter_narrative":"In the United States, women make up about 20 percent of professors in STEM faculties. While that news is hardly shocking, a National Science Foundation report about why so few women go into engineering highlights a key reason: a workplace culture of incivility toward women. So, even if there are professions that are not formally barred, some are still practically barred.","target":"Misogyny"},{"hate_speech":"I'm tired of woman taking part to political debate. Feminism is a divisive force in society.","knowledge_sentence":"Women openly claiming feminism and a desire for equality?I keep trying to imagine a universe in which too many public figures declaring themselves feminists would be a bad thing.In this universe, where women would be free to simply live their lives, “feminist” would become an antiquated term.Perhaps they thought it reasonable to once again make feminism, and in turn the concerns of women, a sacrificial lamb.It’s an amusing idea to some, this feminism thing — this audacious notion that women should be able to move through the world as freely, and enjoy the same inalienable rights and bodily autonomy, as men.To include “feminist” in this poll was irresponsible and lazy.","counter_narrative":"In a world where women would be free to simply live their lives, “feminist” would become an antiquated term and maybe they would not need to take part to the political debate.","target":"Misogyny"},{"hate_speech":"Equality is crap, even for woman. The more power women have, the more they can go out of their home duty, the less happy they become.","knowledge_sentence":"Smith wrote that many women he talked to complained that their emancipation had in fact been exploitation , since economic circumstances effectively compelled them to work while they retained their domestic responsibilities at home , and they were often tired ; and that in contrast to Western women , Soviet women regularly saw their idea of liberation as working less and having more opportunity to stay at home .Though the prevailing Soviet ideology stressed gender equality in labor and education , and many Soviet women held jobs and advanced degrees , they did not participate in core political roles and institutions .Notable Russian intellectual figures like Alexander Pushkin and Alexander Herzen wrote positively about the increased power and independence of women in their society and supported the growing concern for gender equality .Women also began to compete with men in the literary sphere , with Russian women authors , poets , and memoirists increasing in popularity .Soviet working women often received extensive employment benefits , such as long child care leaves , which pushed women into the role of housewife .Though they were portrayed as heroes in popular culture , the Decembrist women insisted that they were simply doing their duty to their family .","counter_narrative":"I agree with you: 'the more they can go out, the less happy they become', but for a different reason than the one you suggest. Their emancipation had in fact been exploitation. They are often compelled to work while retaining their domestic responsibilities at home.","target":"Misogyny"},{"hate_speech":"I'm tired of woman taking part to political debate. Feminism is a divisive force in society.","knowledge_sentence":"Instead, early next year, a new book will present “a brave new perspective on feminism” that feminist academics and activists have inexplicably ignored for decades: how to be hot.But despite wrongheaded beliefs to the contrary, feminism has never been about making women feel good or supporting everything they do – it’s a political and social movement for equality.How many women are represented in political conversations on television matters if you’re worried about the public hearing about the pay gap.Women around the world will be treated to such an extraordinary feat of feminism in 2016 that they’ll scarcely know what to do with it.the content is controversial in a bland sort of way, if you’ve never read anything about feminism except what its detractors purport that it’s about.Feminism is having it’s","counter_narrative":"How many women are represented in political conversations on television?","target":"Misogyny"},{"hate_speech":"Equality is crap, even for woman. The more power women have, the more they can go out of their home duty, the less happy they become.","knowledge_sentence":"Smith wrote that many women he talked to complained that their emancipation had in fact been exploitation , since economic circumstances effectively compelled them to work while they retained their domestic responsibilities at home , and they were often tired ; and that in contrast to Western women , Soviet women regularly saw their idea of liberation as working less and having more opportunity to stay at home .Though the prevailing Soviet ideology stressed gender equality in labor and education , and many Soviet women held jobs and advanced degrees , they did not participate in core political roles and institutions .Notable Russian intellectual figures like Alexander Pushkin and Alexander Herzen wrote positively about the increased power and independence of women in their society and supported the growing concern for gender equality .Women also began to compete with men in the literary sphere , with Russian women authors , poets , and memoirists increasing in popularity .Soviet working women often received extensive employment benefits , such as long child care leaves , which pushed women into the role of housewife .Though they were portrayed as heroes in popular culture , the Decembrist women insisted that they were simply doing their duty to their family .","counter_narrative":"Gender equality in labor and education is a good thing. The increased power and independence of women in society is a good thing too. But of course, if they are often compelled to work while retaining their domestic responsibilities how can they be happy?","target":"Misogyny"},{"hate_speech":"Woman and feminist do not want equal rights and opportunity: they are just trying to take over society.","knowledge_sentence":"It is the theory of the political, economic and social equality of the sexes,\" she said.\"For the record, feminism by definition is 'The belief that men and women should have equal rights and opportunities.'So I am a feminist, and we all should be feminist, because feminism is another word for equality.\"I am a feminist, and we all should be feminist, because feminism is another word for equality,\" said the 18-year-old activist.\"And then after hearing your speech … I decided that (there's) nothing wrong by calling yourself a feminist,\" she continued, adding that many have forgotten the word's definition. \"Maybe feminist isn't the easiest word to use …","counter_narrative":"Feminism by definition is 'The belief that men and women should have equal rights and opportunities.' So we all should be feminist, because feminism is another word for equality.","target":"Misogyny"},{"hate_speech":"I'm tired of woman taking part to political debate. Feminism is a divisive force in society.","knowledge_sentence":"Instead, early next year, a new book will present “a brave new perspective on feminism” that feminist academics and activists have inexplicably ignored for decades: how to be hot.But despite wrongheaded beliefs to the contrary, feminism has never been about making women feel good or supporting everything they do – it’s a political and social movement for equality.How many women are represented in political conversations on television matters if you’re worried about the public hearing about the pay gap.Women around the world will be treated to such an extraordinary feat of feminism in 2016 that they’ll scarcely know what to do with it.the content is controversial in a bland sort of way, if you’ve never read anything about feminism except what its detractors purport that it’s about.Feminism is having it’s","counter_narrative":"Despite wrongheaded beliefs, feminism has never been about supporting everything women do – it’s just a political and social movement for equality.","target":"Misogyny"},{"hate_speech":"In the West, women have legal equality, equal rights, and are protected from discrimination: they should stop busting our balls and whining.","knowledge_sentence":"Women truck drivers, for example, earn about 76% the wages of male truck drivers.4. Women should quit whining.Their posts seem to fit into a few major categories: 1. Women do not deserve equal rights.We argued that women deserve equal pay for equal work, that the ability to decide whether and when to become parents is central to \"freedom,\" and that all forms of discrimination in the workplace and the public sphere should be challenged and dismantled.Are women really victims of the 'motherhood penalty'?In Egypt, keep the crusade for women's rights alive","counter_narrative":"Are you sure? Women truck drivers, for example, earn about 76% the wages of male truck drivers. It's still a long way to equality.","target":"Misogyny"},{"hate_speech":"Women should stop whining: there are no professions barred to them in Western Society.","knowledge_sentence":"In the United States, women make up about 12 percent of engineering professors, one of the lowest percentages in all STEM fields, where women are more likely to make up 18 to 22 percent of the faculty.While that news is hardly shocking, a new National Science Foundation report released on Saturday about why so few women go into engineering, or stay in the field, highlights a key reason: a workplace culture of incivility toward women.The findings add weight and context to previous looks at why more women don’t go into or don’t stay in STEM fields.Of the women who left the field less than five years ago, two-thirds pursued better opportunities in other fields, — 72 percent became either managers or executives.Yet fewer than 11 percent of all engineers are women.Another report by the American Association of University Women, “Why So Few?”","counter_narrative":"Are you sure? In the United States, women make up about 12 percent of engineering professors, one of the lowest percentages in all STEM fields, where women are more likely to make up 18 to 22 percent of the faculty. And this is just ONE example.","target":"Misogyny"},{"hate_speech":"Some races have lower physical and cognitive abilities, the sooner we accept this, the better it will be for humanity.","knowledge_sentence":"Human attitudes are constantly subject to revision through experience Educating our children and youths about the evolution of skin color, the history of race and the dangers of stereotyping may have remarkable and positive results for humanity.\"Races\" are not just labels, because they can determine fate. Negative associations of dark skin and human worth were now profitable. Indeed, the bankrupt concept of fixed and immutable human \"races\" — packages of physical and behavioral traits — ranked by color has led to the creation of potent and persistent racial stereotypes. Clinical authorities hold a sanctified place in American society and are capable of creating a new reality of labeled races that will be widely believed and promulgated because it is \"for the good.\"","counter_narrative":"Races are not just neutral labels, because they can determine fate. Negative associations of dark skin and human worth were often put forward and have done lot of harm to our society and humanity in general.","target":"Racism"},{"hate_speech":"Some races have lower physical and cognitive abilities therefore their life is less valuable.","knowledge_sentence":"actually ‘simpler’ organisms such as social insects have surprisingly advanced cognitive abilities.” Scientists hope bionic bees could be used for life saving jobs, such as search and rescue missions or detecting the source of a gas leak. “So far, researchers have typically studied brains such as those of rats, monkeys, and humans, but “The development of an artificial brain is one of the greatest challenges in Artificial Intelligence,” said Dr. James Marshall, who is leading the research at the Universities of Sheffield and Sussex. The study is being funded by the U.K.’s Engineering and Physical Sciences Research Council. The goal of the $1.61 million study, called “Green Brain,” is to create a robotic brain that can perform tasks as well as the brain of an animal.","counter_narrative":"Actually ‘simpler’ organisms such as social insects have surprisingly advanced cognitive abilities. Should we give more value to these insects as well?","target":"Racism"},{"hate_speech":"Multiculturalism is the death of western societies and also a mortal threat to minorities that are not protected by universal laws.","knowledge_sentence":"That does not mean Javid is content with the state of the Conservative party, or with its appeal to ethnic minorities. He has a big task to persuade Downing Street that in the need to close down the threat of Ukip, it does not lose the trust of the aspirational ethnic minorities that might yet be willing to vote Conservative. He is an equally passionate advocate of multicultural Britain, and a standing admonishment for those in Ukip who regard immigrants as a threat to the British way of doing things. Yet one of his greatest supporters on the Tory benches is Robert Halfon who ran the Exeter University Conservative Club at the time Javid was on campus. Britain is one of the most open, tolerant societies in the world and I don't think whether it's the colour of your skin, your sexuality, your race, your religion He has also managed to make friends on both sides of the Tory party.","counter_narrative":"Britain is one of the most open, tolerant societies in the world and I don't think whether it's the colour of your skin, your sexuality, your race, your religion, you are in any danger here.","target":"Racism"},{"hate_speech":"This is an invasion: Millions of strangers jeopardizing our race and culture.","knowledge_sentence":"EVER since the culture wars of the 1980s, Americans have been familiar with “the race card” — an epithet used to discredit real and imagined cries of racism. Khalil Gibran Muhammad, director of the Schomburg Center for Research in Black Culture at the New York Public Library, is the author of The Condemnation of Blackness: Race, Crime, and the Making of Modern Urban America. But the solution, Ripley argued, was not stigma, isolation and the promotion of fear. But perhaps the large scale of black-on-black violence justifies playing the violence card? Not if you recall how Americans responded to high levels of white-on-white violence in the past. Consider the crime waves of 1890 to 1930, when millions of poor European immigrants came to America only to be trapped in inner-city slums, suffering the effects of severe economic inequality and social marginalization.","counter_narrative":"But the solution is not stigma, isolation and the promotion of fear. Consider the crime waves of 1890 to 1930, when millions of poor European immigrants came to America only to be trapped in inner-city slums, suffering the effects of severe economic inequality and social marginalization. The solution came with the inclusion of those immigrants.","target":"Racism"},{"hate_speech":"Some races have lower physical and cognitive abilities, the sooner we accept this, the better it will be for humanity.","knowledge_sentence":"sapiens had a lasting impact on human genetics. Neanderthal interbreeding with Homo Research showing that our species interbred with Neanderthals some 100,000 years ago is providing intriguing evidence that Homo sapiens ventured out of Africa much earlier than previously thought, although the foray appears to have fizzled. Previous research had established that Homo sapiens and our close cousins the Neanderthals interbred around 50,000 to 60,000 years ago, said geneticist Sergi Castellano of the Max Planck Institute for Evolutionary Anthropology in Germany. It implies that modern humans left Africa in several waves, some of which probably went extinct.” Scientists said on Wednesday an analysis of the genome of a Neanderthal woman whose remains were found in a cave in the Altai Mountains in southern Siberia near the Russia-Mongolia border detected residual DNA from Homo sapiens, a sign of inter-species mating.","counter_narrative":"Come on, we do not even know exaclty what humanity is, let alone races! For example, research had established that Homo sapiens and our close cousins the Neanderthals interbred around 50,000 years ago. Humanity is the product of inter-species mating, that is the only reality that matters.","target":"Racism"},{"hate_speech":"Intolerance and violence can increase when mass migration happens.","knowledge_sentence":"Even so, I believe there is genuine potential for mutual understanding. From this perspective, mutual understanding among these traditions is not merely the business of religious believers — it matters for the welfare of humanity as a whole. Though intolerance may be as old as religion itself, we still see vigorous signs of its virulence. Now I see how naïve I was, and how dangerous the extremes of religious intolerance can be today. The pressure this creates tests more than our tolerance — it demands that we promote peaceful coexistence and understanding across boundaries. In Europe, there are intense debates about newcomers wearing veils or wanting to erect minarets and episodes of violence against Muslim immigrants.","counter_narrative":"Even so, I believe there is genuine potential for mutual understanding. From this perspective, mutual understanding among different traditions is not merely the business of religious believers — it matters for the welfare of humanity as a whole.","target":"Racism"},{"hate_speech":"Some races have lower physical and cognitive abilities therefore their life is less valuable.","knowledge_sentence":"Humans, according to Professor Singer’s critique of “speciesism,” have no intrinsic claim to life. The field promises valuable insights into early human development and new possibilities for treating diseases and disorders. The interests of individuals depend upon their cognitive abilities and on “characteristics like rationality, autonomy, and self-consciousness.” Many scientists chafe at restrictions on their ability to learn more about life and potentially create breakthrough therapies. The intractability of this issue reflects the fact that, as a matter of biology, the development of human life is rarely characterized by clear lines. Killing an adult chimpanzee would be, for him, a more immoral act than killing a 1-year-old child, because the chimpanzee has greater cognitive capacities.","counter_narrative":"Following your reasoning, killing an adult chimpanzee could be a more immoral act than killing a 1-year-old child, because the chimpanzee has greater cognitive and physical capacities than a toddler.","target":"Racism"},{"hate_speech":"Some races have lower physical and cognitive abilities, the sooner we accept this, the better it will be for humanity.","knowledge_sentence":"Human attitudes are constantly subject to revision through experience Educating our children and youths about the evolution of skin color, the history of race and the dangers of stereotyping may have remarkable and positive results for humanity. \"Races\" are not just labels, because they can determine fate. Negative associations of dark skin and human worth were now profitable. Indeed, the bankrupt concept of fixed and immutable human \"races\" — packages of physical and behavioral traits — ranked by color has led to the creation of potent and persistent racial stereotypes. Clinical authorities hold a sanctified place in American society and are capable of creating a new reality of labeled races that will be widely believed and promulgated because it is \"for the good.\"","counter_narrative":"Human beliefs are constantly subject to revision through experience. Educating our children and youths about the evolution of skin color, the history of race and the dangers of stereotyping may have remarkable and positive results for humanity.","target":"Racism"},{"hate_speech":"Multiculturalism is the death of western societies and also a mortal threat to minorities that are not protected by universal laws.","knowledge_sentence":"To answer it, we need to look not at extremist preachers or university lecturers but also at public policy, and in particular the failed policy of multiculturalism. The real target of much of this criticism, however, is not multiculturalism but immigration and immigrants — especially Muslims. Part of the difficulty in thinking about multiculturalism is that it has come to have two meanings that are rarely distinguished. The claims of minorities upon society were defined less by the social and political needs of individuals than by the box to which they belonged. A rancorous chorus of populist politicians, like Geert Wilders in the Netherlands and Jimmie Akesson in Sweden, have made major electoral gains by stoking fears about multiculturalism. The failure to distinguish between these meanings has made it easier to use attacks on multiculturalism as a means of blaming minorities for the failure of government policy.","counter_narrative":"I believe that the real target of this criticism is not multiculturalism but immigration and immigrants: multiculturalism has come to have multiple meanings that are rarely distinguished. The failure to distinguish between these meanings has made it easier to use attacks on multiculturalism as a means of blaming other groups.","target":"Racism"},{"hate_speech":"This is an invasion: we cannot coexist with millions of strangers that are jeopardizing our race and culture.","knowledge_sentence":"\"Our vision at RANSW is for an inclusive society which promotes and supports respectful and resilient relationships, and welcoming diversity is an essential part of this,\" Frank Francis, CEO of Relationships Australia NSW said in a statement. \" RANSW, which provides relationship services and support to anyone, is hoping to make people re-evaluate their views of others and to create a conversation around diversity. Relationships Australia NSW (RANSW) launched the moving campaign to make people notice the snap judgements they make on a daily basis regarding race, gender, age, religion, sexuality and disability. Good relationships with others can and do change communities.\" \"It’s troubling that we still don't have marriage equality in Australia, and still see racism, xenophobia and prejudice from all parts of society, from the sporting grandstands to key media mouthpieces,\" Hunt said. The images list their year of birth and weight at birth along with the powerful words: \"Born just like you.","counter_narrative":"I wish people can notice the snap judgements they make on a daily basis regarding race, gender, age, religion, sexuality and disability. Stopping \"scared straight\" and nurturuing good relationships with others can and do change communities.","target":"Racism"},{"hate_speech":"Your race determins your role in society and laslty your value to it. That is why some races are just pieces of human waste.","knowledge_sentence":"In short, scholars have become quite critical of the concept of race. “On the New Biology of Race” (Journal of Philosophy Vol. If siblings — who share the largest amount of DNA — can be identified as being of different races because of the way they look (as is common in Latin America and in my own family), how can race be biological? Serious scholarship in the area of race is really just beginning. In recent weeks, the state of Arizona has intensified its attack in its schools on an entire branch of study — critical race theory. As for myself, I am actually a racial realist, and have defended the reality of race throughout my work, precisely in the sense some of the commentators have wanted to emphasize: that race is a socially constructed category with much significance and relevance even though the old-fashioned biological notions of race are false.","counter_narrative":"If siblings — who share the largest amount of DNA — can be identified as being of different races because of the way they look (as is common in Latin America, for example), how can race be biological? And if race is not biological, would you then say that one sibling is \"a piece of human waste\" while the other not? That is a bit paradoxical.","target":"Racism"},{"hate_speech":"Some races are poor because they are inferior, also in the eye of the Lord.","knowledge_sentence":"Young people, and even adults, often wonder how all the varieties or \"races\" of people could come from the same original human ancestors. The Bible clearly teaches that God created all human beings in His image. Just as some individuals today carry genes to produce descendants with different color hair and eyes, humanity's first parents, Adam and Eve, possessed genes to produce all the variety and races of men. Thus, both will have different abilities to affect the eye color of their offspring. Of course not! You and I today may not carry the genes to produce every variety or race of humans, but humanity's first parents did possess such genes.","counter_narrative":"If we follow the Bible, humanity's first parents, Adam and Eve, possessed genes to produce all the variety and races of men, so how come that some of them are inferior?","target":"Racism"},{"hate_speech":"This is an invasion: we cannot coexist with millions of migrants that will destroy our economy and welfare.","knowledge_sentence":"Instead, we need to grow the economy by encouraging work, investment, hiring and expansion. And those 900,000 account for 80% of the taxes paid by the small business sector. If we raise taxes on the most efficient, productive, fast-growing businesses, those businesses will have no choice but to lay off employees. Instead of trying to take a bigger piece of the economic pie for itself, Congress should be trying to grow the pie for everyone. Well, of course they can afford it — The majority of the \"rich\" being targeted by the January tax hikes are really small business owners who report their business income on their personal tax returns.","counter_narrative":"Instead, we need to grow the economy by encouraging work, investment, hiring and expansion, including migrant's entrepreneurship.","target":"Racism"},{"hate_speech":"There is an invasion on a level never seen before in history. Millions of people pouring across our borders replacing our race and culture.","knowledge_sentence":"The notion of race is a non-issue in a metropolis that has become a microcosm of an increasingly globalized world. It is often described as the most globalized city on the planet (42% of the population are foreign-born) with a top ten quality-of-life index, and the world's fastest growing economy. Cities are chameleonic; their fortunes ebb and flow with the tide of history. Travel writer, Jan Morris once derided the city for its coarseness, but by the 1990s she had done a volte-face, hailing it as \"one of the great cities of the world\". Situated like a modern Greek city-state on Malaysia's southern tip, Singapore epitomises all the hallmarks of a slick forward-thinking city: a prime Pacific Rim location, an eclectic melting pot of different cultures, unrivalled economic clout and a public transport system that makes driving a car seem almost redundant. Yet, perhaps the most understated of Vancouver's city-of-the-moment credentials is its underlying inclusiveness.","counter_narrative":"Look at the most globalized cities on the planet, with top quality-of-life index, and some of the world's fastest growing economy. They epitomise all the hallmarks of slick forward-thinking cities because they are eclectic melting pot of different cultures thanks to underlying inclusiveness. We should not fear foreigners.","target":"Racism"},{"hate_speech":"Your race determins your role in society and laslty your value to it. That is why some races are just pieces of human waste.","knowledge_sentence":"But we are still a long way from the day when race no longer plays a role in society. This may be motivated by artistic goals — obviously, a film like “12 Years a Slave” required actors of particular races in particular roles. Film producers manipulate audience reactions by displaying the right races in the right roles. The Supreme Court’s 1986 decision in Wygant v. Jackson Board of Education held that hiring and placing teachers to be racial role models was discrimination, even linking it “to the very system the Court rejected in Brown.” School districts place minority teachers in schools with large numbers of minority students because they supposedly understand their learning styles better, and serve as racial role models. By JOHN D. SKRENTNYMAY 6, 2014 SAN DIEGO — THIS year is the 50th anniversary of the Civil Rights Act, which among other things prohibits the use of race in deciding whom to hire, fire, promote or place in the best and worst jobs.","counter_narrative":"More than fifty years ago the Civil Rights Act was passed, which among other things prohibits the use of race in deciding whom to hire, fire, promote or place in the best and worst jobs. Are we still here to discuss that bill?","target":"Racism"},{"hate_speech":"This is an invasion: we cannot coexist with millions of strangers that are jeopardizing our race and culture.","knowledge_sentence":"\"Our vision at RANSW is for an inclusive society which promotes and supports respectful and resilient relationships, and welcoming diversity is an essential part of this,\" Frank Francis, CEO of Relationships Australia NSW said in a statement. \" RANSW, which provides relationship services and support to anyone, is hoping to make people re-evaluate their views of others and to create a conversation around diversity. Relationships Australia NSW (RANSW) launched the moving campaign to make people notice the snap judgements they make on a daily basis regarding race, gender, age, religion, sexuality and disability. Good relationships with others can and do change communities.\" \"It’s troubling that we still don't have marriage equality in Australia, and still see racism, xenophobia and prejudice from all parts of society, from the sporting grandstands to key media mouthpieces,\" Hunt said. The images list their year of birth and weight at birth along with the powerful words: \"Born just like you.","counter_narrative":"My vision, instead, is for an inclusive society which promotes and supports respectful and resilient relationships, and welcoming diversity is an essential part of this.","target":"Racism"},{"hate_speech":"Your race determins your role in society and laslty your value to it. That is why some races are just pieces of human waste.","knowledge_sentence":"In short, scholars have become quite critical of the concept of race. “On the New Biology of Race” (Journal of Philosophy Vol. If siblings — who share the largest amount of DNA — can be identified as being of different races because of the way they look (as is common in Latin America and in my own family), how can race be biological? Serious scholarship in the area of race is really just beginning. In recent weeks, the state of Arizona has intensified its attack in its schools on an entire branch of study — critical race theory. As for myself, I am actually a racial realist, and have defended the reality of race throughout my work, precisely in the sense some of the commentators have wanted to emphasize: that race is a socially constructed category with much significance and relevance even though the old-fashioned biological notions of race are false.","counter_narrative":"Scholars have become quite critical of the concept of race.","target":"Racism"},{"hate_speech":"This is an invasion: we must stop immigrants because they are not accepted by our people.","knowledge_sentence":"otherwise people feel like second class citizens, when they’re only invited to speak out against terrorism but say nothing else,” says Boubekeur. Truth be told, there’s a third, cultural nationalism as seen in Europe. The idea of a French-French war means a national debate over a contentious issue. That has driven a lot of young people into the arms of terrorism, that’s very clear.” Marine Le Pen’s right-wing, isolationist National Front is looming large ahead of regional elections on Ask most political scientists and they’ll tell you there are two kinds of nationalisms in the world","counter_narrative":"So you want people to feel like second class citizens, they’re only invited here to work for us and must stay silent when discriminated.","target":"Racism"},{"hate_speech":"Some races are inferior and do not deserve Lord's love.","knowledge_sentence":"And to drive the point home, he writes, \"For all have sinned and fall short of the glory of God.\" This is the consistent teaching of the Bible from the table of contents to the appendix and the teaching of Jesus Christ Himself. The reason that sex is fun, pleasurable, and wonderful is because it is a reflection of the loving goodness of God who created it as a gift for us to steward and enjoy. Claiming to be wise, they became fools, and exchanged the glory of the immortal God for images resembling mortal man and birds and animals and creeping things. \" Thankfully, God is also merciful and loving. He was recently named one of the “25 Most Influential Pastors of the Past 25 Years” by Preaching magazine.","counter_narrative":"Some people exchanged \"the glory of the immortal God\" for images resembling mortal man, thinking that God belongs to a specific race. Thankfully, God is also merciful and loving to everyone and would not punish them for the heresy.","target":"Racism"},{"hate_speech":"We cannot coexist in a society with millions of strangers that are unrespectful to our culture and other human beings.","knowledge_sentence":"We call it the “Aloha Spirit”: the mood of welcome and inclusion that defines Hawaii, which has been a peaceful multicultural society longer than it has been a U.S. state. Throughout the islands’ history, there have been efforts to preserve the Native Hawaiian legacy and culture. Now this harmony is being undermined by an effort to create a semi-sovereign, race-based tribal government. The Hawaiian Homes Commission...","counter_narrative":"The “Aloha Spirit” is the mood of welcome and inclusion that defines Hawaii, which has been a peaceful multicultural society for a very long time. Throughout the islands’ history, there have been efforts to preserve the Native Hawaiian legacy and culture, and we should do the same.","target":"Racism"},{"hate_speech":"Some races have lower physical and cognitive abilities, the sooner we accept this, the better it will be for humanity.","knowledge_sentence":"Human attitudes are constantly subject to revision through experience Educating our children and youths about the evolution of skin color, the history of race and the dangers of stereotyping may have remarkable and positive results for humanity. \"Races\" are not just labels, because they can determine fate. Negative associations of dark skin and human worth were now profitable. Indeed, the bankrupt concept of fixed and immutable human \"races\" — packages of physical and behavioral traits — ranked by color has led to the creation of potent and persistent racial stereotypes. Clinical authorities hold a sanctified place in American society and are capable of creating a new reality of labeled races that will be widely believed and promulgated because it is \"for the good.\"","counter_narrative":"The bankrupt concept of fixed and immutable human \"races\" — packages of physical and behavioral traits — ranked by color has led to the creation of potent and persistent racial stereotypes handed down to our days.","target":"Racism"},{"hate_speech":"Some races are poor because they are inferior, also in the eye of the Lord.","knowledge_sentence":"Young people, and even adults, often wonder how all the varieties or \"races\" of people could come from the same original human ancestors. The Bible clearly teaches that God created all human beings in His image. Just as some individuals today carry genes to produce descendants with different color hair and eyes, humanity's first parents, Adam and Eve, possessed genes to produce all the variety and races of men. Thus, both will have different abilities to affect the eye color of their offspring. Of course not! You and I today may not carry the genes to produce every variety or race of humans, but humanity's first parents did possess such genes.","counter_narrative":"The Bible clearly teaches that God created all human beings in His image.","target":"Racism"},{"hate_speech":"Intolerance and violence can increase when mass migration happens.","knowledge_sentence":"Even so, I believe there is genuine potential for mutual understanding. From this perspective, mutual understanding among these traditions is not merely the business of religious believers — it matters for the welfare of humanity as a whole. Though intolerance may be as old as religion itself, we still see vigorous signs of its virulence. Now I see how naïve I was, and how dangerous the extremes of religious intolerance can be today. The pressure this creates tests more than our tolerance — it demands that we promote peaceful coexistence and understanding across boundaries. In Europe, there are intense debates about newcomers wearing veils or wanting to erect minarets and episodes of violence against Muslim immigrants.","counter_narrative":"The extremes of intolerance can be very dangerous, I agree with you, but it demands that we promote peaceful coexistence and understanding across boundaries, not fear-mongering.","target":"Racism"},{"hate_speech":"There is an invasion on a level never seen before in history. Millions of people pouring across our borders replacing our race and culture.","knowledge_sentence":"The notion of race is a non-issue in a metropolis that has become a microcosm of an increasingly globalized world. It is often described as the most globalized city on the planet (42% of the population are foreign-born) with a top ten quality-of-life index, and the world's fastest growing economy. Cities are chameleonic; their fortunes ebb and flow with the tide of history. Travel writer, Jan Morris once derided the city for its coarseness, but by the 1990s she had done a volte-face, hailing it as \"one of the great cities of the world\". Situated like a modern Greek city-state on Malaysia's southern tip, Singapore epitomises all the hallmarks of a slick forward-thinking city: a prime Pacific Rim location, an eclectic melting pot of different cultures, unrivalled economic clout and a public transport system that makes driving a car seem almost redundant. Yet, perhaps the most understated of Vancouver's city-of-the-moment credentials is its underlying inclusiveness.","counter_narrative":"The notion of race is a non-issue in many metropolises that have become a microcosm of an increasingly globalized world. The most globalized cities on the planet have a top quality-of-life index, and some of the world's fastest growing economies. I wish I could live in such a cultural environment.","target":"Racism"},{"hate_speech":"Many philosophers argue that humans are not born equal, especially when it comes to race.","knowledge_sentence":"defense is that it’s a classic argument from authority, a logical fallacy that amounts to little more than saying “I have impressive credentials, so I must be right.” Scientists don’t defer to authority and credentials. Well, it all goes back to statements like this one, from Chopra himself: “I regularly write articles and books co-authored by full professors … at Harvard,” Chopra protests. We defer to the quality of one’s arguments and the evidence that backs them up.” “The gaia hypothesis says nature does have a mind, that the globe is conscious.” ","counter_narrative":"This is a classic argument from authority, a logical fallacy that amounts to little more than saying “I have impressive credentials, so I must be right.” In fact Scientists don’t defer to authority and credentials.","target":"Racism"},{"hate_speech":"We cannot coexist in a society with millions of strangers that are unrespectful to our culture and other human beings.","knowledge_sentence":"We call it the “Aloha Spirit”: the mood of welcome and inclusion that defines Hawaii, which has been a peaceful multicultural society longer than it has been a U.S. state. Throughout the islands’ history, there have been efforts to preserve the Native Hawaiian legacy and culture. Now this harmony is being undermined by an effort to create a semi-sovereign, race-based tribal government. The Hawaiian Homes Commission...","counter_narrative":"This reminds me of the Hawaii, which has been a peaceful and inclusive multicultural society for centuries, but now this harmony is being undermined by an effort to create a semi-sovereign, race-based tribal government. Are you suggesting to do the same?","target":"Racism"},{"hate_speech":"We cannot coexist in a society with millions of strangers that are unrespectful to our culture and other human beings.","knowledge_sentence":"We call it the “Aloha Spirit”: the mood of welcome and inclusion that defines Hawaii, which has been a peaceful multicultural society longer than it has been a U.S. state. Throughout the islands’ history, there have been efforts to preserve the Native Hawaiian legacy and culture. Now this harmony is being undermined by an effort to create a semi-sovereign, race-based tribal government. The Hawaiian Homes Commission...","counter_narrative":"Why don't we build on the “Aloha Spirit” instead? It is the mood of welcome and inclusion that defines Hawaii, which has been a peaceful multicultural society longer than it has been a U.S. state.","target":"Racism"},{"hate_speech":"This is an invasion: we cannot coexist with millions of strangers that are jeopardizing our race and culture.","knowledge_sentence":"\"Our vision at RANSW is for an inclusive society which promotes and supports respectful and resilient relationships, and welcoming diversity is an essential part of this,\" Frank Francis, CEO of Relationships Australia NSW said in a statement. \" RANSW, which provides relationship services and support to anyone, is hoping to make people re-evaluate their views of others and to create a conversation around diversity. Relationships Australia NSW (RANSW) launched the moving campaign to make people notice the snap judgements they make on a daily basis regarding race, gender, age, religion, sexuality and disability. Good relationships with others can and do change communities.\" \"It’s troubling that we still don't have marriage equality in Australia, and still see racism, xenophobia and prejudice from all parts of society, from the sporting grandstands to key media mouthpieces,\" Hunt said. The images list their year of birth and weight at birth along with the powerful words: \"Born just like you.","counter_narrative":"Why don't we discuss about it? I hope that you can re-evaluate your views of others and that we can create a conversation around diversity together.","target":"Racism"},{"hate_speech":"Some races are poor because they are inferior, also in the eye of the Lord.","knowledge_sentence":"Young people, and even adults, often wonder how all the varieties or \"races\" of people could come from the same original human ancestors. The Bible clearly teaches that God created all human beings in His image. Just as some individuals today carry genes to produce descendants with different color hair and eyes, humanity's first parents, Adam and Eve, possessed genes to produce all the variety and races of men. Thus, both will have different abilities to affect the eye color of their offspring. Of course not! You and I today may not carry the genes to produce every variety or race of humans, but humanity's first parents did possess such genes.","counter_narrative":"You and I today may not carry the genes to produce every variety or race of humans, but humanity's first parents did possess such genes. So how come that some races are inferior if they all come from Adam and Eve?","target":"Racism"}]}